; ModuleID = '/home/zzhzz/ISSTA23-Artifacts/parser/testcases/dnstracer.c'
source_filename = "/home/zzhzz/ISSTA23-Artifacts/parser/testcases/dnstracer.c"
target datalayout = "e-m:e-p:32:32-i64:64-n32:64-S128-ni:1:10:20"
target triple = "wasm32-unknown-wasi"

%struct._IO_FILE = type opaque
%struct.arecord = type { i8*, i8*, i32, i8*, i8*, %struct.arecord* }
%struct.answer = type { i8*, %struct.answer* }
%struct.busy = type { i8*, %struct.busy* }
%struct.__res_9_state = type { i32, i32, i32, i32, [3 x %struct.sockaddr_in], i16, [7 x i8*], [256 x i8], i32, i8, [3 x i8], [10 x %struct.anon], i32 (i32 (%struct.sockaddr**, i8**, i32*, i8*, i32, i32*)*)*, i32 (i32 (%struct.sockaddr*, i8*, i32, i8*, i32, i32*)*)*, i32, i32, i32, i32, %union.anon.1 }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.anon = type { %struct.in_addr, i32 }
%struct.sockaddr = type { i16, [0 x i8], [14 x i8] }
%union.anon.1 = type { %struct.anon.2, [24 x i8] }
%struct.anon.2 = type { i16, [3 x i16], [3 x i32], %struct.__res_9_state_ext* }
%struct.__res_9_state_ext = type opaque
%struct.dnssession = type { %struct.dnsheader*, %struct.dnsquestion*, %struct.dnsheader*, %struct.dnsquestion*, %struct.dnsrr*, %struct.dnsrr*, %struct.dnsrr*, %struct.dnssession*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32 }
%struct.dnsheader = type { i16, %union.anon, i16, i16, i16, i16 }
%union.anon = type { i16 }
%struct.dnsquestion = type { i32, i8*, i16, i16 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !10, line: 118, type: !73, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project fd1d8c2f04dde23bee0fb3a7d069a9b1046da979)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !110, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "testcases/<stdin>", directory: "/home/zzhzz/ISSTA23-Artifacts/parser")
!4 = !{}
!5 = !{!6, !8, !13, !25, !48, !55, !14, !56, !67, !77, !82, !87, !109}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 32)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dnsrr", file: !10, line: 484, size: 256, elements: !11)
!10 = !DIFile(filename: "testcases/dnstracer.c", directory: "/home/zzhzz/ISSTA23-Artifacts/parser")
!11 = !{!12, !15, !16, !18, !19, !21, !22, !23, !24}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !9, file: !10, line: 485, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "domainname_string", scope: !9, file: !10, line: 486, baseType: !13, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !9, file: !10, line: 487, baseType: !17, size: 16, offset: 64)
!17 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !9, file: !10, line: 488, baseType: !17, size: 16, offset: 80)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !9, file: !10, line: 489, baseType: !20, size: 32, offset: 96)
!20 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "datalength", scope: !9, file: !10, line: 490, baseType: !17, size: 16, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !9, file: !10, line: 491, baseType: !13, size: 32, offset: 160)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "data_string", scope: !9, file: !10, line: 492, baseType: !13, size: 32, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !9, file: !10, line: 493, baseType: !8, size: 32, offset: 224)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dnsheader", file: !10, line: 445, size: 96, elements: !27)
!27 = !{!28, !29, !44, !45, !46, !47}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "identification", scope: !26, file: !10, line: 446, baseType: !17, size: 16)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !26, file: !10, line: 470, baseType: !30, size: 16, offset: 16)
!30 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !26, file: !10, line: 447, size: 16, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !30, file: !10, line: 448, baseType: !17, size: 16)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !30, file: !10, line: 469, baseType: !34, size: 16)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit", file: !10, line: 449, size: 16, elements: !35)
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !34, file: !10, line: 460, baseType: !14, size: 4, flags: DIFlagBitField, extraData: i64 0)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !34, file: !10, line: 461, baseType: !14, size: 3, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ra", scope: !34, file: !10, line: 462, baseType: !14, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "rd", scope: !34, file: !10, line: 463, baseType: !14, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !34, file: !10, line: 464, baseType: !14, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !34, file: !10, line: 465, baseType: !14, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !34, file: !10, line: 466, baseType: !14, size: 4, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "qr", scope: !34, file: !10, line: 467, baseType: !14, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "nquestions", scope: !26, file: !10, line: 471, baseType: !17, size: 16, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nanswerRR", scope: !26, file: !10, line: 472, baseType: !17, size: 16, offset: 48)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "nauthorityRR", scope: !26, file: !10, line: 473, baseType: !17, size: 16, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "nadditionalRR", scope: !26, file: !10, line: 474, baseType: !17, size: 16, offset: 80)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dnsquestion", file: !10, line: 477, size: 96, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "querylength", scope: !49, file: !10, line: 478, baseType: !20, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !49, file: !10, line: 479, baseType: !13, size: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !49, file: !10, line: 480, baseType: !17, size: 16, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !49, file: !10, line: 481, baseType: !17, size: 16, offset: 80)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !58, line: 9, size: 128, elements: !59)
!58 = !DIFile(filename: "/data/wasi-sdk/build/wasi-sdk-14.0/share/wasi-sysroot/include/__struct_sockaddr.h", directory: "")
!59 = !{!60, !63}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !57, file: !58, line: 10, baseType: !61, size: 16, align: 128)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !62, line: 4, baseType: !17)
!62 = !DIFile(filename: "/data/wasi-sdk/build/wasi-sdk-14.0/share/wasi-sysroot/include/__typedef_sa_family_t.h", directory: "")
!63 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !57, file: !58, line: 11, baseType: !64, offset: 16)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 0)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 32)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arecord", file: !10, line: 401, size: 192, elements: !69)
!69 = !{!70, !71, !72, !74, !75, !76}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !68, file: !10, line: 402, baseType: !6, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "server_ip", scope: !68, file: !10, line: 403, baseType: !6, size: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !68, file: !10, line: 404, baseType: !73, size: 32, offset: 64)
!73 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "rr_name", scope: !68, file: !10, line: 405, baseType: !6, size: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "rr_data", scope: !68, file: !10, line: 406, baseType: !6, size: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !10, line: 407, baseType: !67, size: 32, offset: 160)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !10, line: 415, size: 64, elements: !79)
!79 = !{!80, !81}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !78, file: !10, line: 416, baseType: !6, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !78, file: !10, line: 417, baseType: !77, size: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 32)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "busy", file: !10, line: 410, size: 64, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !83, file: !10, line: 411, baseType: !6, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !83, file: !10, line: 412, baseType: !82, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dnssession", file: !10, line: 420, size: 608, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "send_header", scope: !88, file: !10, line: 421, baseType: !25, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "send_question", scope: !88, file: !10, line: 422, baseType: !48, size: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "recv_header", scope: !88, file: !10, line: 423, baseType: !25, size: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "recv_question", scope: !88, file: !10, line: 424, baseType: !48, size: 32, offset: 96)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "answer", scope: !88, file: !10, line: 425, baseType: !8, size: 32, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !88, file: !10, line: 426, baseType: !8, size: 32, offset: 160)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "additional", scope: !88, file: !10, line: 427, baseType: !8, size: 32, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !88, file: !10, line: 428, baseType: !87, size: 32, offset: 224)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !88, file: !10, line: 430, baseType: !6, size: 32, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !88, file: !10, line: 431, baseType: !6, size: 32, offset: 288)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "recv_len", scope: !88, file: !10, line: 433, baseType: !73, size: 32, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "recv_pkt", scope: !88, file: !10, line: 434, baseType: !6, size: 32, offset: 352)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "recv_pkt_header", scope: !88, file: !10, line: 435, baseType: !6, size: 32, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "recv_pkt_question", scope: !88, file: !10, line: 436, baseType: !6, size: 32, offset: 416)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "recv_pkt_answer", scope: !88, file: !10, line: 437, baseType: !6, size: 32, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "recv_pkt_authority", scope: !88, file: !10, line: 438, baseType: !6, size: 32, offset: 480)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "recv_pkt_additional", scope: !88, file: !10, line: 439, baseType: !6, size: 32, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "socket", scope: !88, file: !10, line: 441, baseType: !73, size: 32, offset: 544)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6", scope: !88, file: !10, line: 442, baseType: !73, size: 32, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!110 = !{!0, !111, !113, !115, !117, !119, !121, !123, !125, !127, !132, !140, !145, !150, !155, !160, !162, !164}
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "global_overview", scope: !2, file: !10, line: 119, type: !73, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "global_retries", scope: !2, file: !10, line: 120, type: !73, isLocal: false, isDefinition: true)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "global_caching", scope: !2, file: !10, line: 121, type: !73, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "global_negative_caching", scope: !2, file: !10, line: 122, type: !73, isLocal: false, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "global_querytype", scope: !2, file: !10, line: 123, type: !73, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "global_noipv6", scope: !2, file: !10, line: 124, type: !73, isLocal: false, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "global_timeout", scope: !2, file: !10, line: 125, type: !73, isLocal: false, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "global_source_address", scope: !2, file: !10, line: 126, type: !6, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "rr_types", scope: !2, file: !10, line: 496, type: !129, isLocal: false, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 8192, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 256)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "hostname", scope: !134, file: !10, line: 577, type: !137, isLocal: true, isDefinition: true)
!134 = distinct !DISubprogram(name: "getname", scope: !10, file: !10, line: 573, type: !135, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!135 = !DISubroutineType(types: !136)
!136 = !{!6, !87, !109}
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8200, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 1025)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "hostname", scope: !142, file: !10, line: 757, type: !137, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "printablename", scope: !10, file: !10, line: 755, type: !143, scopeLine: 756, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!143 = !DISubroutineType(types: !144)
!144 = !{!6, !6, !73}
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "retval", scope: !147, file: !10, line: 821, type: !137, isLocal: true, isDefinition: true)
!147 = distinct !DISubprogram(name: "get_ttl", scope: !10, file: !10, line: 819, type: !148, scopeLine: 820, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!148 = !DISubroutineType(types: !149)
!149 = !{!6, !73}
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "retval", scope: !152, file: !10, line: 854, type: !137, isLocal: true, isDefinition: true)
!152 = distinct !DISubprogram(name: "get_resource", scope: !10, file: !10, line: 852, type: !153, scopeLine: 853, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!153 = !DISubroutineType(types: !154)
!154 = !{!6, !73, !87, !6, !73}
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "retval", scope: !152, file: !10, line: 917, type: !157, isLocal: true, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 24600, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 3075)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "arecords", scope: !2, file: !10, line: 1303, type: !67, isLocal: false, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "answers", scope: !2, file: !10, line: 1354, type: !77, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "busies", scope: !2, file: !10, line: 1390, type: !82, isLocal: false, isDefinition: true)
!166 = !{i32 7, !"Dwarf Version", i32 4}
!167 = !{i32 2, !"Debug Info Version", i32 3}
!168 = !{i32 1, !"wchar_size", i32 4}
!169 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project fd1d8c2f04dde23bee0fb3a7d069a9b1046da979)"}
!170 = distinct !DISubprogram(name: "strnrcasecmp", scope: !10, file: !10, line: 543, type: !171, scopeLine: 544, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!171 = !DISubroutineType(types: !172)
!172 = !{!73, !173, !173, !175}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !176, line: 72, baseType: !177)
!176 = !DIFile(filename: "/data/wasi-sdk/build/wasi-sdk-14.0/share/wasi-sysroot/include/bits/alltypes.h", directory: "")
!177 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!178 = !DILocalVariable(name: "big", arg: 1, scope: !170, file: !10, line: 543, type: !173)
!179 = !DILocation(line: 543, column: 26, scope: !170)
!180 = !DILocalVariable(name: "little", arg: 2, scope: !170, file: !10, line: 543, type: !173)
!181 = !DILocation(line: 543, column: 43, scope: !170)
!182 = !DILocalVariable(name: "len", arg: 3, scope: !170, file: !10, line: 543, type: !175)
!183 = !DILocation(line: 543, column: 58, scope: !170)
!184 = !DILocalVariable(name: "p", scope: !170, file: !10, line: 545, type: !6)
!185 = !DILocation(line: 545, column: 11, scope: !170)
!186 = !DILocalVariable(name: "lenl", scope: !170, file: !10, line: 546, type: !175)
!187 = !DILocation(line: 546, column: 12, scope: !170)
!188 = !DILocalVariable(name: "lenb", scope: !170, file: !10, line: 546, type: !175)
!189 = !DILocation(line: 546, column: 18, scope: !170)
!190 = !DILocation(line: 548, column: 19, scope: !170)
!191 = !DILocation(line: 548, column: 12, scope: !170)
!192 = !DILocation(line: 548, column: 10, scope: !170)
!193 = !DILocation(line: 549, column: 19, scope: !170)
!194 = !DILocation(line: 549, column: 12, scope: !170)
!195 = !DILocation(line: 549, column: 10, scope: !170)
!196 = !DILocation(line: 551, column: 9, scope: !197)
!197 = distinct !DILexicalBlock(scope: !170, file: !10, line: 551, column: 9)
!198 = !DILocation(line: 551, column: 16, scope: !197)
!199 = !DILocation(line: 551, column: 14, scope: !197)
!200 = !DILocation(line: 551, column: 9, scope: !170)
!201 = !DILocation(line: 552, column: 2, scope: !197)
!202 = !DILocation(line: 553, column: 9, scope: !203)
!203 = distinct !DILexicalBlock(scope: !170, file: !10, line: 553, column: 9)
!204 = !DILocation(line: 553, column: 15, scope: !203)
!205 = !DILocation(line: 553, column: 13, scope: !203)
!206 = !DILocation(line: 553, column: 9, scope: !170)
!207 = !DILocation(line: 554, column: 2, scope: !203)
!208 = !DILocation(line: 556, column: 17, scope: !170)
!209 = !DILocation(line: 556, column: 23, scope: !170)
!210 = !DILocation(line: 556, column: 21, scope: !170)
!211 = !DILocation(line: 556, column: 30, scope: !170)
!212 = !DILocation(line: 556, column: 28, scope: !170)
!213 = !DILocation(line: 556, column: 7, scope: !170)
!214 = !DILocation(line: 557, column: 24, scope: !170)
!215 = !DILocation(line: 557, column: 27, scope: !170)
!216 = !DILocation(line: 557, column: 35, scope: !170)
!217 = !DILocation(line: 557, column: 12, scope: !170)
!218 = !DILocation(line: 557, column: 5, scope: !170)
!219 = !DILocation(line: 558, column: 1, scope: !170)
!220 = distinct !DISubprogram(name: "getlong", scope: !10, file: !10, line: 561, type: !221, scopeLine: 562, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!221 = !DISubroutineType(types: !222)
!222 = !{!20, !13}
!223 = !DILocalVariable(name: "s", arg: 1, scope: !220, file: !10, line: 561, type: !13)
!224 = !DILocation(line: 561, column: 24, scope: !220)
!225 = !DILocation(line: 563, column: 24, scope: !220)
!226 = !DILocation(line: 563, column: 23, scope: !220)
!227 = !DILocation(line: 563, column: 39, scope: !220)
!228 = !DILocation(line: 563, column: 38, scope: !220)
!229 = !DILocation(line: 563, column: 29, scope: !220)
!230 = !DILocation(line: 563, column: 50, scope: !220)
!231 = !DILocation(line: 563, column: 49, scope: !220)
!232 = !DILocation(line: 563, column: 44, scope: !220)
!233 = !DILocation(line: 563, column: 57, scope: !220)
!234 = !DILocation(line: 563, column: 55, scope: !220)
!235 = !DILocation(line: 563, column: 5, scope: !220)
!236 = distinct !DISubprogram(name: "getshort", scope: !10, file: !10, line: 567, type: !237, scopeLine: 568, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!237 = !DISubroutineType(types: !238)
!238 = !{!17, !13}
!239 = !DILocalVariable(name: "s", arg: 1, scope: !236, file: !10, line: 567, type: !13)
!240 = !DILocation(line: 567, column: 25, scope: !236)
!241 = !DILocation(line: 569, column: 16, scope: !236)
!242 = !DILocation(line: 569, column: 15, scope: !236)
!243 = !DILocation(line: 569, column: 23, scope: !236)
!244 = !DILocation(line: 569, column: 21, scope: !236)
!245 = !DILocation(line: 569, column: 12, scope: !236)
!246 = !DILocation(line: 569, column: 5, scope: !236)
!247 = !DILocalVariable(name: "session", arg: 1, scope: !134, file: !10, line: 573, type: !87)
!248 = !DILocation(line: 573, column: 28, scope: !134)
!249 = !DILocalVariable(name: "thisname", arg: 2, scope: !134, file: !10, line: 573, type: !109)
!250 = !DILocation(line: 573, column: 44, scope: !134)
!251 = !DILocalVariable(name: "compressing", scope: !134, file: !10, line: 575, type: !73)
!252 = !DILocation(line: 575, column: 10, scope: !134)
!253 = !DILocalVariable(name: "p", scope: !134, file: !10, line: 576, type: !6)
!254 = !DILocation(line: 576, column: 12, scope: !134)
!255 = !DILocation(line: 586, column: 10, scope: !256)
!256 = distinct !DILexicalBlock(scope: !134, file: !10, line: 586, column: 9)
!257 = !DILocation(line: 586, column: 9, scope: !256)
!258 = !DILocation(line: 586, column: 22, scope: !256)
!259 = !DILocation(line: 586, column: 9, scope: !134)
!260 = !DILocation(line: 587, column: 2, scope: !261)
!261 = distinct !DILexicalBlock(scope: !256, file: !10, line: 586, column: 28)
!262 = !DILocation(line: 588, column: 4, scope: !261)
!263 = !DILocation(line: 588, column: 13, scope: !261)
!264 = !DILocation(line: 589, column: 2, scope: !261)
!265 = !DILocation(line: 592, column: 10, scope: !134)
!266 = !DILocation(line: 592, column: 9, scope: !134)
!267 = !DILocation(line: 592, column: 7, scope: !134)
!268 = !DILocation(line: 593, column: 5, scope: !134)
!269 = !DILocation(line: 594, column: 5, scope: !134)
!270 = !DILocation(line: 594, column: 12, scope: !134)
!271 = !DILocation(line: 594, column: 17, scope: !134)
!272 = !DILocation(line: 601, column: 7, scope: !273)
!273 = distinct !DILexicalBlock(scope: !274, file: !10, line: 601, column: 6)
!274 = distinct !DILexicalBlock(scope: !134, file: !10, line: 594, column: 23)
!275 = !DILocation(line: 601, column: 11, scope: !273)
!276 = !DILocation(line: 601, column: 18, scope: !273)
!277 = !DILocation(line: 601, column: 6, scope: !274)
!278 = !DILocalVariable(name: "offset", scope: !279, file: !10, line: 602, type: !20)
!279 = distinct !DILexicalBlock(scope: !273, file: !10, line: 601, column: 24)
!280 = !DILocation(line: 602, column: 19, scope: !279)
!281 = !DILocalVariable(name: "oldp", scope: !279, file: !10, line: 603, type: !7)
!282 = !DILocation(line: 603, column: 11, scope: !279)
!283 = !DILocation(line: 605, column: 13, scope: !279)
!284 = !DILocation(line: 605, column: 11, scope: !279)
!285 = !DILocation(line: 606, column: 6, scope: !279)
!286 = !DILocation(line: 606, column: 11, scope: !279)
!287 = !DILocation(line: 607, column: 24, scope: !279)
!288 = !DILocation(line: 607, column: 15, scope: !279)
!289 = !DILocation(line: 607, column: 13, scope: !279)
!290 = !DILocation(line: 608, column: 13, scope: !279)
!291 = !DILocation(line: 608, column: 6, scope: !279)
!292 = !DILocation(line: 608, column: 11, scope: !279)
!293 = !DILocation(line: 609, column: 10, scope: !279)
!294 = !DILocation(line: 609, column: 19, scope: !279)
!295 = !DILocation(line: 609, column: 30, scope: !279)
!296 = !DILocation(line: 609, column: 28, scope: !279)
!297 = !DILocation(line: 609, column: 8, scope: !279)
!298 = !DILocation(line: 610, column: 10, scope: !299)
!299 = distinct !DILexicalBlock(scope: !279, file: !10, line: 610, column: 10)
!300 = !DILocation(line: 610, column: 22, scope: !299)
!301 = !DILocation(line: 610, column: 10, scope: !279)
!302 = !DILocation(line: 610, column: 29, scope: !299)
!303 = !DILocation(line: 610, column: 38, scope: !299)
!304 = !DILocation(line: 610, column: 28, scope: !299)
!305 = !DILocation(line: 612, column: 18, scope: !279)
!306 = !DILocation(line: 613, column: 6, scope: !279)
!307 = distinct !{!307, !269, !308, !309}
!308 = !DILocation(line: 630, column: 5, scope: !134)
!309 = !{!"llvm.loop.mustprogress"}
!310 = !DILocation(line: 624, column: 20, scope: !274)
!311 = !DILocation(line: 624, column: 18, scope: !274)
!312 = !DILocation(line: 624, column: 38, scope: !274)
!313 = !DILocation(line: 624, column: 41, scope: !274)
!314 = !DILocation(line: 624, column: 46, scope: !274)
!315 = !DILocation(line: 624, column: 2, scope: !274)
!316 = !DILocation(line: 625, column: 6, scope: !317)
!317 = distinct !DILexicalBlock(scope: !274, file: !10, line: 625, column: 6)
!318 = !DILocation(line: 625, column: 18, scope: !317)
!319 = !DILocation(line: 625, column: 6, scope: !274)
!320 = !DILocation(line: 626, column: 19, scope: !321)
!321 = distinct !DILexicalBlock(scope: !317, file: !10, line: 625, column: 24)
!322 = !DILocation(line: 626, column: 24, scope: !321)
!323 = !DILocation(line: 626, column: 7, scope: !321)
!324 = !DILocation(line: 626, column: 16, scope: !321)
!325 = !DILocation(line: 627, column: 11, scope: !326)
!326 = distinct !DILexicalBlock(scope: !321, file: !10, line: 627, column: 10)
!327 = !DILocation(line: 627, column: 10, scope: !326)
!328 = !DILocation(line: 627, column: 23, scope: !326)
!329 = !DILocation(line: 627, column: 10, scope: !321)
!330 = !DILocation(line: 627, column: 30, scope: !326)
!331 = !DILocation(line: 627, column: 39, scope: !326)
!332 = !DILocation(line: 627, column: 29, scope: !326)
!333 = !DILocation(line: 628, column: 2, scope: !321)
!334 = !DILocation(line: 629, column: 7, scope: !274)
!335 = !DILocation(line: 629, column: 12, scope: !274)
!336 = !DILocation(line: 629, column: 4, scope: !274)
!337 = !DILocation(line: 632, column: 5, scope: !134)
!338 = !DILocation(line: 633, column: 1, scope: !134)
!339 = distinct !DISubprogram(name: "extract_rr", scope: !10, file: !10, line: 636, type: !340, scopeLine: 637, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!340 = !DISubroutineType(types: !341)
!341 = !{!6, !87, !6, !342}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!343 = !DILocalVariable(name: "session", arg: 1, scope: !339, file: !10, line: 636, type: !87)
!344 = !DILocation(line: 636, column: 31, scope: !339)
!345 = !DILocalVariable(name: "thisrr", arg: 2, scope: !339, file: !10, line: 636, type: !6)
!346 = !DILocation(line: 636, column: 46, scope: !339)
!347 = !DILocalVariable(name: "rr", arg: 3, scope: !339, file: !10, line: 636, type: !342)
!348 = !DILocation(line: 636, column: 69, scope: !339)
!349 = !DILocalVariable(name: "RR", scope: !339, file: !10, line: 638, type: !8)
!350 = !DILocation(line: 638, column: 20, scope: !339)
!351 = !DILocalVariable(name: "domainname", scope: !339, file: !10, line: 639, type: !6)
!352 = !DILocation(line: 639, column: 13, scope: !339)
!353 = !DILocalVariable(name: "p", scope: !339, file: !10, line: 640, type: !6)
!354 = !DILocation(line: 640, column: 13, scope: !339)
!355 = !DILocation(line: 642, column: 26, scope: !339)
!356 = !DILocation(line: 642, column: 10, scope: !339)
!357 = !DILocation(line: 642, column: 8, scope: !339)
!358 = !DILocation(line: 643, column: 17, scope: !339)
!359 = !DILocation(line: 643, column: 16, scope: !339)
!360 = !DILocation(line: 643, column: 5, scope: !339)
!361 = !DILocation(line: 643, column: 9, scope: !339)
!362 = !DILocation(line: 643, column: 14, scope: !339)
!363 = !DILocation(line: 650, column: 26, scope: !339)
!364 = !DILocation(line: 650, column: 18, scope: !339)
!365 = !DILocation(line: 650, column: 16, scope: !339)
!366 = !DILocation(line: 651, column: 29, scope: !339)
!367 = !DILocation(line: 651, column: 22, scope: !339)
!368 = !DILocation(line: 651, column: 5, scope: !339)
!369 = !DILocation(line: 651, column: 9, scope: !339)
!370 = !DILocation(line: 651, column: 20, scope: !339)
!371 = !DILocation(line: 652, column: 50, scope: !339)
!372 = !DILocation(line: 652, column: 36, scope: !339)
!373 = !DILocation(line: 652, column: 29, scope: !339)
!374 = !DILocation(line: 652, column: 5, scope: !339)
!375 = !DILocation(line: 652, column: 9, scope: !339)
!376 = !DILocation(line: 652, column: 27, scope: !339)
!377 = !DILocation(line: 653, column: 25, scope: !339)
!378 = !DILocation(line: 653, column: 16, scope: !339)
!379 = !DILocation(line: 653, column: 5, scope: !339)
!380 = !DILocation(line: 653, column: 9, scope: !339)
!381 = !DILocation(line: 653, column: 14, scope: !339)
!382 = !DILocation(line: 654, column: 26, scope: !339)
!383 = !DILocation(line: 654, column: 33, scope: !339)
!384 = !DILocation(line: 654, column: 17, scope: !339)
!385 = !DILocation(line: 654, column: 5, scope: !339)
!386 = !DILocation(line: 654, column: 9, scope: !339)
!387 = !DILocation(line: 654, column: 15, scope: !339)
!388 = !DILocation(line: 655, column: 23, scope: !339)
!389 = !DILocation(line: 655, column: 30, scope: !339)
!390 = !DILocation(line: 655, column: 15, scope: !339)
!391 = !DILocation(line: 655, column: 5, scope: !339)
!392 = !DILocation(line: 655, column: 9, scope: !339)
!393 = !DILocation(line: 655, column: 13, scope: !339)
!394 = !DILocation(line: 656, column: 31, scope: !339)
!395 = !DILocation(line: 656, column: 38, scope: !339)
!396 = !DILocation(line: 656, column: 22, scope: !339)
!397 = !DILocation(line: 656, column: 5, scope: !339)
!398 = !DILocation(line: 656, column: 9, scope: !339)
!399 = !DILocation(line: 656, column: 20, scope: !339)
!400 = !DILocation(line: 657, column: 43, scope: !339)
!401 = !DILocation(line: 657, column: 47, scope: !339)
!402 = !DILocation(line: 657, column: 33, scope: !339)
!403 = !DILocation(line: 657, column: 5, scope: !339)
!404 = !DILocation(line: 657, column: 9, scope: !339)
!405 = !DILocation(line: 657, column: 14, scope: !339)
!406 = !DILocation(line: 658, column: 12, scope: !339)
!407 = !DILocation(line: 658, column: 16, scope: !339)
!408 = !DILocation(line: 658, column: 22, scope: !339)
!409 = !DILocation(line: 658, column: 29, scope: !339)
!410 = !DILocation(line: 658, column: 35, scope: !339)
!411 = !DILocation(line: 658, column: 39, scope: !339)
!412 = !DILocation(line: 658, column: 5, scope: !339)
!413 = !DILocation(line: 660, column: 9, scope: !339)
!414 = !DILocation(line: 660, column: 16, scope: !339)
!415 = !DILocation(line: 660, column: 7, scope: !339)
!416 = !DILocation(line: 661, column: 43, scope: !339)
!417 = !DILocation(line: 661, column: 47, scope: !339)
!418 = !DILocation(line: 661, column: 53, scope: !339)
!419 = !DILocation(line: 661, column: 62, scope: !339)
!420 = !DILocation(line: 661, column: 30, scope: !339)
!421 = !DILocation(line: 661, column: 23, scope: !339)
!422 = !DILocation(line: 661, column: 5, scope: !339)
!423 = !DILocation(line: 661, column: 9, scope: !339)
!424 = !DILocation(line: 661, column: 21, scope: !339)
!425 = !DILocation(line: 662, column: 20, scope: !339)
!426 = !DILocation(line: 662, column: 24, scope: !339)
!427 = !DILocation(line: 662, column: 18, scope: !339)
!428 = !DILocation(line: 662, column: 12, scope: !339)
!429 = !DILocation(line: 664, column: 11, scope: !339)
!430 = !DILocation(line: 664, column: 6, scope: !339)
!431 = !DILocation(line: 664, column: 9, scope: !339)
!432 = !DILocation(line: 665, column: 12, scope: !339)
!433 = !DILocation(line: 665, column: 5, scope: !339)
!434 = !DILocalVariable(name: "name", arg: 1, scope: !142, file: !10, line: 755, type: !6)
!435 = !DILocation(line: 755, column: 21, scope: !142)
!436 = !DILocalVariable(name: "withdots", arg: 2, scope: !142, file: !10, line: 755, type: !73)
!437 = !DILocation(line: 755, column: 31, scope: !142)
!438 = !DILocalVariable(name: "p", scope: !142, file: !10, line: 758, type: !6)
!439 = !DILocation(line: 758, column: 11, scope: !142)
!440 = !DILocalVariable(name: "q", scope: !142, file: !10, line: 758, type: !7)
!441 = !DILocation(line: 758, column: 14, scope: !142)
!442 = !DILocation(line: 764, column: 9, scope: !443)
!443 = distinct !DILexicalBlock(scope: !142, file: !10, line: 764, column: 9)
!444 = !DILocation(line: 764, column: 14, scope: !443)
!445 = !DILocation(line: 764, column: 22, scope: !443)
!446 = !DILocation(line: 764, column: 25, scope: !443)
!447 = !DILocation(line: 764, column: 33, scope: !443)
!448 = !DILocation(line: 764, column: 9, scope: !142)
!449 = !DILocation(line: 765, column: 6, scope: !450)
!450 = distinct !DILexicalBlock(scope: !451, file: !10, line: 765, column: 6)
!451 = distinct !DILexicalBlock(scope: !443, file: !10, line: 764, column: 39)
!452 = !DILocation(line: 765, column: 15, scope: !450)
!453 = !DILocation(line: 765, column: 6, scope: !451)
!454 = !DILocation(line: 766, column: 6, scope: !450)
!455 = !DILocation(line: 768, column: 6, scope: !450)
!456 = !DILocation(line: 769, column: 2, scope: !451)
!457 = !DILocation(line: 772, column: 17, scope: !142)
!458 = !DILocation(line: 773, column: 9, scope: !142)
!459 = !DILocation(line: 773, column: 7, scope: !142)
!460 = !DILocation(line: 774, column: 5, scope: !142)
!461 = !DILocation(line: 774, column: 12, scope: !142)
!462 = !DILocation(line: 774, column: 17, scope: !142)
!463 = !DILocation(line: 775, column: 6, scope: !464)
!464 = distinct !DILexicalBlock(scope: !465, file: !10, line: 775, column: 6)
!465 = distinct !DILexicalBlock(scope: !142, file: !10, line: 774, column: 23)
!466 = !DILocation(line: 775, column: 15, scope: !464)
!467 = !DILocation(line: 775, column: 6, scope: !465)
!468 = !DILocation(line: 776, column: 25, scope: !464)
!469 = !DILocation(line: 776, column: 23, scope: !464)
!470 = !DILocation(line: 776, column: 51, scope: !464)
!471 = !DILocation(line: 776, column: 6, scope: !464)
!472 = !DILocation(line: 778, column: 6, scope: !464)
!473 = !DILocation(line: 779, column: 6, scope: !465)
!474 = !DILocation(line: 779, column: 8, scope: !465)
!475 = !DILocation(line: 779, column: 13, scope: !465)
!476 = !DILocation(line: 779, column: 4, scope: !465)
!477 = !DILocation(line: 780, column: 2, scope: !465)
!478 = !DILocation(line: 780, column: 4, scope: !465)
!479 = !DILocation(line: 780, column: 9, scope: !465)
!480 = !DILocation(line: 780, column: 14, scope: !465)
!481 = !DILocation(line: 781, column: 21, scope: !465)
!482 = !DILocation(line: 781, column: 19, scope: !465)
!483 = !DILocation(line: 781, column: 45, scope: !465)
!484 = !DILocation(line: 781, column: 47, scope: !465)
!485 = !DILocation(line: 781, column: 2, scope: !465)
!486 = !DILocation(line: 782, column: 6, scope: !465)
!487 = !DILocation(line: 782, column: 10, scope: !465)
!488 = !DILocation(line: 782, column: 8, scope: !465)
!489 = !DILocation(line: 782, column: 15, scope: !465)
!490 = !DILocation(line: 782, column: 4, scope: !465)
!491 = !DILocation(line: 783, column: 9, scope: !465)
!492 = !DILocation(line: 783, column: 2, scope: !465)
!493 = !DILocation(line: 783, column: 7, scope: !465)
!494 = distinct !{!494, !460, !495, !309}
!495 = !DILocation(line: 784, column: 5, scope: !142)
!496 = !DILocation(line: 786, column: 9, scope: !497)
!497 = distinct !DILexicalBlock(scope: !142, file: !10, line: 786, column: 9)
!498 = !DILocation(line: 786, column: 18, scope: !497)
!499 = !DILocation(line: 786, column: 9, scope: !142)
!500 = !DILocation(line: 787, column: 2, scope: !497)
!501 = !DILocation(line: 789, column: 2, scope: !497)
!502 = !DILocation(line: 790, column: 1, scope: !142)
!503 = !DILocalVariable(name: "type", arg: 1, scope: !152, file: !10, line: 852, type: !73)
!504 = !DILocation(line: 852, column: 18, scope: !152)
!505 = !DILocalVariable(name: "session", arg: 2, scope: !152, file: !10, line: 852, type: !87)
!506 = !DILocation(line: 852, column: 43, scope: !152)
!507 = !DILocalVariable(name: "buffer", arg: 3, scope: !152, file: !10, line: 852, type: !6)
!508 = !DILocation(line: 852, column: 58, scope: !152)
!509 = !DILocalVariable(name: "dots", arg: 4, scope: !152, file: !10, line: 852, type: !73)
!510 = !DILocation(line: 852, column: 70, scope: !152)
!511 = !DILocation(line: 861, column: 13, scope: !152)
!512 = !DILocation(line: 861, column: 5, scope: !152)
!513 = !DILocation(line: 864, column: 18, scope: !514)
!514 = distinct !DILexicalBlock(scope: !152, file: !10, line: 861, column: 19)
!515 = !DILocation(line: 864, column: 3, scope: !514)
!516 = !DILocation(line: 865, column: 18, scope: !514)
!517 = !DILocation(line: 865, column: 3, scope: !514)
!518 = !DILocation(line: 866, column: 18, scope: !514)
!519 = !DILocation(line: 866, column: 3, scope: !514)
!520 = !DILocation(line: 867, column: 18, scope: !514)
!521 = !DILocation(line: 867, column: 3, scope: !514)
!522 = !DILocation(line: 863, column: 2, scope: !514)
!523 = !DILocation(line: 868, column: 2, scope: !514)
!524 = !DILocation(line: 874, column: 18, scope: !514)
!525 = !DILocation(line: 874, column: 3, scope: !514)
!526 = !DILocation(line: 874, column: 45, scope: !514)
!527 = !DILocation(line: 874, column: 30, scope: !514)
!528 = !DILocation(line: 875, column: 18, scope: !514)
!529 = !DILocation(line: 875, column: 3, scope: !514)
!530 = !DILocation(line: 875, column: 45, scope: !514)
!531 = !DILocation(line: 875, column: 30, scope: !514)
!532 = !DILocation(line: 876, column: 18, scope: !514)
!533 = !DILocation(line: 876, column: 3, scope: !514)
!534 = !DILocation(line: 876, column: 45, scope: !514)
!535 = !DILocation(line: 876, column: 30, scope: !514)
!536 = !DILocation(line: 877, column: 18, scope: !514)
!537 = !DILocation(line: 877, column: 3, scope: !514)
!538 = !DILocation(line: 877, column: 45, scope: !514)
!539 = !DILocation(line: 877, column: 30, scope: !514)
!540 = !DILocation(line: 878, column: 18, scope: !514)
!541 = !DILocation(line: 878, column: 3, scope: !514)
!542 = !DILocation(line: 878, column: 45, scope: !514)
!543 = !DILocation(line: 878, column: 30, scope: !514)
!544 = !DILocation(line: 879, column: 18, scope: !514)
!545 = !DILocation(line: 879, column: 3, scope: !514)
!546 = !DILocation(line: 879, column: 45, scope: !514)
!547 = !DILocation(line: 879, column: 30, scope: !514)
!548 = !DILocation(line: 880, column: 18, scope: !514)
!549 = !DILocation(line: 880, column: 3, scope: !514)
!550 = !DILocation(line: 880, column: 45, scope: !514)
!551 = !DILocation(line: 880, column: 30, scope: !514)
!552 = !DILocation(line: 881, column: 18, scope: !514)
!553 = !DILocation(line: 881, column: 3, scope: !514)
!554 = !DILocation(line: 881, column: 45, scope: !514)
!555 = !DILocation(line: 881, column: 30, scope: !514)
!556 = !DILocation(line: 871, column: 2, scope: !514)
!557 = !DILocation(line: 883, column: 2, scope: !514)
!558 = !DILocation(line: 886, column: 39, scope: !514)
!559 = !DILocation(line: 886, column: 31, scope: !514)
!560 = !DILocation(line: 886, column: 58, scope: !514)
!561 = !DILocation(line: 886, column: 17, scope: !514)
!562 = !DILocation(line: 886, column: 2, scope: !514)
!563 = !DILocation(line: 887, column: 2, scope: !514)
!564 = !DILocation(line: 890, column: 39, scope: !514)
!565 = !DILocation(line: 890, column: 31, scope: !514)
!566 = !DILocation(line: 890, column: 58, scope: !514)
!567 = !DILocation(line: 890, column: 17, scope: !514)
!568 = !DILocation(line: 890, column: 2, scope: !514)
!569 = !DILocation(line: 891, column: 2, scope: !514)
!570 = !DILocalVariable(name: "us", scope: !571, file: !10, line: 895, type: !17)
!571 = distinct !DILexicalBlock(scope: !514, file: !10, line: 894, column: 5)
!572 = !DILocation(line: 895, column: 17, scope: !571)
!573 = !DILocation(line: 897, column: 16, scope: !571)
!574 = !DILocation(line: 897, column: 7, scope: !571)
!575 = !DILocation(line: 897, column: 5, scope: !571)
!576 = !DILocation(line: 898, column: 9, scope: !571)
!577 = !DILocation(line: 899, column: 28, scope: !571)
!578 = !DILocation(line: 899, column: 54, scope: !571)
!579 = !DILocation(line: 899, column: 46, scope: !571)
!580 = !DILocation(line: 899, column: 73, scope: !571)
!581 = !DILocation(line: 899, column: 32, scope: !571)
!582 = !DILocation(line: 899, column: 2, scope: !571)
!583 = !DILocation(line: 900, column: 2, scope: !571)
!584 = !DILocation(line: 904, column: 39, scope: !514)
!585 = !DILocation(line: 904, column: 31, scope: !514)
!586 = !DILocation(line: 904, column: 58, scope: !514)
!587 = !DILocation(line: 904, column: 17, scope: !514)
!588 = !DILocation(line: 904, column: 2, scope: !514)
!589 = !DILocation(line: 905, column: 2, scope: !514)
!590 = !DILocation(line: 908, column: 39, scope: !514)
!591 = !DILocation(line: 908, column: 31, scope: !514)
!592 = !DILocation(line: 908, column: 58, scope: !514)
!593 = !DILocation(line: 908, column: 17, scope: !514)
!594 = !DILocation(line: 908, column: 2, scope: !514)
!595 = !DILocation(line: 909, column: 2, scope: !514)
!596 = !DILocation(line: 912, column: 39, scope: !514)
!597 = !DILocation(line: 912, column: 31, scope: !514)
!598 = !DILocation(line: 912, column: 58, scope: !514)
!599 = !DILocation(line: 912, column: 17, scope: !514)
!600 = !DILocation(line: 912, column: 2, scope: !514)
!601 = !DILocation(line: 913, column: 2, scope: !514)
!602 = !DILocalVariable(name: "mname", scope: !603, file: !10, line: 918, type: !137)
!603 = distinct !DILexicalBlock(scope: !514, file: !10, line: 916, column: 5)
!604 = !DILocation(line: 918, column: 7, scope: !603)
!605 = !DILocalVariable(name: "rname", scope: !603, file: !10, line: 919, type: !137)
!606 = !DILocation(line: 919, column: 7, scope: !603)
!607 = !DILocalVariable(name: "ul", scope: !603, file: !10, line: 920, type: !177)
!608 = !DILocation(line: 920, column: 16, scope: !603)
!609 = !DILocation(line: 922, column: 9, scope: !603)
!610 = !DILocation(line: 922, column: 38, scope: !603)
!611 = !DILocation(line: 922, column: 30, scope: !603)
!612 = !DILocation(line: 922, column: 57, scope: !603)
!613 = !DILocation(line: 922, column: 16, scope: !603)
!614 = !DILocation(line: 922, column: 2, scope: !603)
!615 = !DILocation(line: 923, column: 9, scope: !603)
!616 = !DILocation(line: 923, column: 38, scope: !603)
!617 = !DILocation(line: 923, column: 30, scope: !603)
!618 = !DILocation(line: 923, column: 57, scope: !603)
!619 = !DILocation(line: 923, column: 16, scope: !603)
!620 = !DILocation(line: 923, column: 2, scope: !603)
!621 = !DILocation(line: 925, column: 15, scope: !603)
!622 = !DILocation(line: 925, column: 7, scope: !603)
!623 = !DILocation(line: 925, column: 5, scope: !603)
!624 = !DILocation(line: 926, column: 53, scope: !603)
!625 = !DILocation(line: 926, column: 57, scope: !603)
!626 = !DILocation(line: 926, column: 64, scope: !603)
!627 = !DILocation(line: 926, column: 2, scope: !603)
!628 = !DILocation(line: 927, column: 2, scope: !603)
!629 = !DILocation(line: 930, column: 14, scope: !514)
!630 = !DILocation(line: 933, column: 1, scope: !152)
!631 = distinct !DISubprogram(name: "extract_data", scope: !10, file: !10, line: 669, type: !632, scopeLine: 670, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !87}
!634 = !DILocalVariable(name: "session", arg: 1, scope: !631, file: !10, line: 669, type: !87)
!635 = !DILocation(line: 669, column: 33, scope: !631)
!636 = !DILocalVariable(name: "header", scope: !631, file: !10, line: 671, type: !25)
!637 = !DILocation(line: 671, column: 24, scope: !631)
!638 = !DILocalVariable(name: "question", scope: !631, file: !10, line: 672, type: !48)
!639 = !DILocation(line: 672, column: 25, scope: !631)
!640 = !DILocalVariable(name: "answer", scope: !631, file: !10, line: 673, type: !8)
!641 = !DILocation(line: 673, column: 20, scope: !631)
!642 = !DILocalVariable(name: "authority", scope: !631, file: !10, line: 674, type: !8)
!643 = !DILocation(line: 674, column: 20, scope: !631)
!644 = !DILocalVariable(name: "additional", scope: !631, file: !10, line: 675, type: !8)
!645 = !DILocation(line: 675, column: 20, scope: !631)
!646 = !DILocalVariable(name: "pheader", scope: !631, file: !10, line: 677, type: !6)
!647 = !DILocation(line: 677, column: 12, scope: !631)
!648 = !DILocalVariable(name: "pquestion", scope: !631, file: !10, line: 678, type: !6)
!649 = !DILocation(line: 678, column: 12, scope: !631)
!650 = !DILocalVariable(name: "panswer", scope: !631, file: !10, line: 679, type: !6)
!651 = !DILocation(line: 679, column: 12, scope: !631)
!652 = !DILocalVariable(name: "pauthority", scope: !631, file: !10, line: 680, type: !6)
!653 = !DILocation(line: 680, column: 12, scope: !631)
!654 = !DILocalVariable(name: "padditional", scope: !631, file: !10, line: 681, type: !6)
!655 = !DILocation(line: 681, column: 12, scope: !631)
!656 = !DILocalVariable(name: "pbuffer", scope: !631, file: !10, line: 683, type: !6)
!657 = !DILocation(line: 683, column: 11, scope: !631)
!658 = !DILocalVariable(name: "i", scope: !631, file: !10, line: 684, type: !73)
!659 = !DILocation(line: 684, column: 9, scope: !631)
!660 = !DILocation(line: 686, column: 15, scope: !631)
!661 = !DILocation(line: 686, column: 24, scope: !631)
!662 = !DILocation(line: 686, column: 13, scope: !631)
!663 = !DILocation(line: 691, column: 32, scope: !631)
!664 = !DILocation(line: 691, column: 5, scope: !631)
!665 = !DILocation(line: 691, column: 14, scope: !631)
!666 = !DILocation(line: 691, column: 30, scope: !631)
!667 = !DILocation(line: 692, column: 15, scope: !631)
!668 = !DILocation(line: 692, column: 13, scope: !631)
!669 = !DILocation(line: 693, column: 34, scope: !631)
!670 = !DILocation(line: 693, column: 14, scope: !631)
!671 = !DILocation(line: 693, column: 12, scope: !631)
!672 = !DILocation(line: 694, column: 12, scope: !631)
!673 = !DILocation(line: 694, column: 5, scope: !631)
!674 = !DILocation(line: 694, column: 20, scope: !631)
!675 = !DILocation(line: 694, column: 29, scope: !631)
!676 = !DILocation(line: 695, column: 36, scope: !631)
!677 = !DILocation(line: 695, column: 44, scope: !631)
!678 = !DILocation(line: 695, column: 30, scope: !631)
!679 = !DILocation(line: 695, column: 5, scope: !631)
!680 = !DILocation(line: 695, column: 13, scope: !631)
!681 = !DILocation(line: 695, column: 28, scope: !631)
!682 = !DILocation(line: 696, column: 33, scope: !631)
!683 = !DILocation(line: 696, column: 41, scope: !631)
!684 = !DILocation(line: 696, column: 47, scope: !631)
!685 = !DILocation(line: 696, column: 27, scope: !631)
!686 = !DILocation(line: 696, column: 5, scope: !631)
!687 = !DILocation(line: 696, column: 13, scope: !631)
!688 = !DILocation(line: 696, column: 19, scope: !631)
!689 = !DILocation(line: 696, column: 25, scope: !631)
!690 = !DILocation(line: 697, column: 32, scope: !631)
!691 = !DILocation(line: 697, column: 40, scope: !631)
!692 = !DILocation(line: 697, column: 26, scope: !631)
!693 = !DILocation(line: 697, column: 5, scope: !631)
!694 = !DILocation(line: 697, column: 13, scope: !631)
!695 = !DILocation(line: 697, column: 24, scope: !631)
!696 = !DILocation(line: 698, column: 31, scope: !631)
!697 = !DILocation(line: 698, column: 39, scope: !631)
!698 = !DILocation(line: 698, column: 25, scope: !631)
!699 = !DILocation(line: 698, column: 5, scope: !631)
!700 = !DILocation(line: 698, column: 13, scope: !631)
!701 = !DILocation(line: 698, column: 23, scope: !631)
!702 = !DILocation(line: 699, column: 34, scope: !631)
!703 = !DILocation(line: 699, column: 42, scope: !631)
!704 = !DILocation(line: 699, column: 28, scope: !631)
!705 = !DILocation(line: 699, column: 5, scope: !631)
!706 = !DILocation(line: 699, column: 13, scope: !631)
!707 = !DILocation(line: 699, column: 26, scope: !631)
!708 = !DILocation(line: 700, column: 35, scope: !631)
!709 = !DILocation(line: 700, column: 43, scope: !631)
!710 = !DILocation(line: 700, column: 29, scope: !631)
!711 = !DILocation(line: 700, column: 5, scope: !631)
!712 = !DILocation(line: 700, column: 13, scope: !631)
!713 = !DILocation(line: 700, column: 27, scope: !631)
!714 = !DILocation(line: 701, column: 13, scope: !631)
!715 = !DILocation(line: 706, column: 34, scope: !631)
!716 = !DILocation(line: 706, column: 5, scope: !631)
!717 = !DILocation(line: 706, column: 14, scope: !631)
!718 = !DILocation(line: 706, column: 32, scope: !631)
!719 = !DILocation(line: 707, column: 17, scope: !631)
!720 = !DILocation(line: 707, column: 15, scope: !631)
!721 = !DILocation(line: 708, column: 38, scope: !631)
!722 = !DILocation(line: 708, column: 16, scope: !631)
!723 = !DILocation(line: 708, column: 14, scope: !631)
!724 = !DILocation(line: 709, column: 38, scope: !631)
!725 = !DILocation(line: 709, column: 30, scope: !631)
!726 = !DILocation(line: 709, column: 23, scope: !631)
!727 = !DILocation(line: 709, column: 5, scope: !631)
!728 = !DILocation(line: 709, column: 15, scope: !631)
!729 = !DILocation(line: 709, column: 21, scope: !631)
!730 = !DILocation(line: 710, column: 31, scope: !631)
!731 = !DILocation(line: 710, column: 22, scope: !631)
!732 = !DILocation(line: 710, column: 5, scope: !631)
!733 = !DILocation(line: 710, column: 15, scope: !631)
!734 = !DILocation(line: 710, column: 20, scope: !631)
!735 = !DILocation(line: 711, column: 32, scope: !631)
!736 = !DILocation(line: 711, column: 42, scope: !631)
!737 = !DILocation(line: 711, column: 23, scope: !631)
!738 = !DILocation(line: 711, column: 5, scope: !631)
!739 = !DILocation(line: 711, column: 15, scope: !631)
!740 = !DILocation(line: 711, column: 21, scope: !631)
!741 = !DILocation(line: 712, column: 15, scope: !631)
!742 = !DILocation(line: 712, column: 25, scope: !631)
!743 = !DILocation(line: 712, column: 13, scope: !631)
!744 = !DILocation(line: 717, column: 32, scope: !631)
!745 = !DILocation(line: 717, column: 5, scope: !631)
!746 = !DILocation(line: 717, column: 14, scope: !631)
!747 = !DILocation(line: 717, column: 30, scope: !631)
!748 = !DILocation(line: 718, column: 12, scope: !749)
!749 = distinct !DILexicalBlock(scope: !631, file: !10, line: 718, column: 5)
!750 = !DILocation(line: 718, column: 10, scope: !749)
!751 = !DILocation(line: 718, column: 17, scope: !752)
!752 = distinct !DILexicalBlock(scope: !749, file: !10, line: 718, column: 5)
!753 = !DILocation(line: 718, column: 21, scope: !752)
!754 = !DILocation(line: 718, column: 29, scope: !752)
!755 = !DILocation(line: 718, column: 19, scope: !752)
!756 = !DILocation(line: 718, column: 5, scope: !749)
!757 = !DILocation(line: 719, column: 12, scope: !758)
!758 = distinct !DILexicalBlock(scope: !752, file: !10, line: 718, column: 45)
!759 = !DILocation(line: 719, column: 10, scope: !758)
!760 = !DILocation(line: 720, column: 23, scope: !758)
!761 = !DILocation(line: 720, column: 32, scope: !758)
!762 = !DILocation(line: 720, column: 12, scope: !758)
!763 = !DILocation(line: 720, column: 10, scope: !758)
!764 = !DILocation(line: 721, column: 5, scope: !758)
!765 = !DILocation(line: 718, column: 41, scope: !752)
!766 = !DILocation(line: 718, column: 5, scope: !752)
!767 = distinct !{!767, !756, !768, !309}
!768 = !DILocation(line: 721, column: 5, scope: !749)
!769 = !DILocation(line: 726, column: 35, scope: !631)
!770 = !DILocation(line: 726, column: 5, scope: !631)
!771 = !DILocation(line: 726, column: 14, scope: !631)
!772 = !DILocation(line: 726, column: 33, scope: !631)
!773 = !DILocation(line: 727, column: 12, scope: !774)
!774 = distinct !DILexicalBlock(scope: !631, file: !10, line: 727, column: 5)
!775 = !DILocation(line: 727, column: 10, scope: !774)
!776 = !DILocation(line: 727, column: 17, scope: !777)
!777 = distinct !DILexicalBlock(scope: !774, file: !10, line: 727, column: 5)
!778 = !DILocation(line: 727, column: 21, scope: !777)
!779 = !DILocation(line: 727, column: 29, scope: !777)
!780 = !DILocation(line: 727, column: 19, scope: !777)
!781 = !DILocation(line: 727, column: 5, scope: !774)
!782 = !DILocation(line: 728, column: 15, scope: !783)
!783 = distinct !DILexicalBlock(scope: !777, file: !10, line: 727, column: 48)
!784 = !DILocation(line: 728, column: 13, scope: !783)
!785 = !DILocation(line: 729, column: 23, scope: !783)
!786 = !DILocation(line: 729, column: 32, scope: !783)
!787 = !DILocation(line: 729, column: 12, scope: !783)
!788 = !DILocation(line: 729, column: 10, scope: !783)
!789 = !DILocation(line: 730, column: 5, scope: !783)
!790 = !DILocation(line: 727, column: 44, scope: !777)
!791 = !DILocation(line: 727, column: 5, scope: !777)
!792 = distinct !{!792, !781, !793, !309}
!793 = !DILocation(line: 730, column: 5, scope: !774)
!794 = !DILocation(line: 735, column: 36, scope: !631)
!795 = !DILocation(line: 735, column: 5, scope: !631)
!796 = !DILocation(line: 735, column: 14, scope: !631)
!797 = !DILocation(line: 735, column: 34, scope: !631)
!798 = !DILocation(line: 736, column: 12, scope: !799)
!799 = distinct !DILexicalBlock(scope: !631, file: !10, line: 736, column: 5)
!800 = !DILocation(line: 736, column: 10, scope: !799)
!801 = !DILocation(line: 736, column: 17, scope: !802)
!802 = distinct !DILexicalBlock(scope: !799, file: !10, line: 736, column: 5)
!803 = !DILocation(line: 736, column: 21, scope: !802)
!804 = !DILocation(line: 736, column: 29, scope: !802)
!805 = !DILocation(line: 736, column: 19, scope: !802)
!806 = !DILocation(line: 736, column: 5, scope: !799)
!807 = !DILocation(line: 737, column: 16, scope: !808)
!808 = distinct !DILexicalBlock(scope: !802, file: !10, line: 736, column: 49)
!809 = !DILocation(line: 737, column: 14, scope: !808)
!810 = !DILocation(line: 738, column: 23, scope: !808)
!811 = !DILocation(line: 738, column: 32, scope: !808)
!812 = !DILocation(line: 738, column: 12, scope: !808)
!813 = !DILocation(line: 738, column: 10, scope: !808)
!814 = !DILocation(line: 739, column: 5, scope: !808)
!815 = !DILocation(line: 736, column: 45, scope: !802)
!816 = !DILocation(line: 736, column: 5, scope: !802)
!817 = distinct !{!817, !806, !818, !309}
!818 = !DILocation(line: 739, column: 5, scope: !799)
!819 = !DILocation(line: 741, column: 28, scope: !631)
!820 = !DILocation(line: 741, column: 5, scope: !631)
!821 = !DILocation(line: 741, column: 14, scope: !631)
!822 = !DILocation(line: 741, column: 26, scope: !631)
!823 = !DILocation(line: 742, column: 30, scope: !631)
!824 = !DILocation(line: 742, column: 5, scope: !631)
!825 = !DILocation(line: 742, column: 14, scope: !631)
!826 = !DILocation(line: 742, column: 28, scope: !631)
!827 = !DILocation(line: 743, column: 23, scope: !631)
!828 = !DILocation(line: 743, column: 5, scope: !631)
!829 = !DILocation(line: 743, column: 14, scope: !631)
!830 = !DILocation(line: 743, column: 21, scope: !631)
!831 = !DILocation(line: 744, column: 27, scope: !631)
!832 = !DILocation(line: 744, column: 5, scope: !631)
!833 = !DILocation(line: 744, column: 14, scope: !631)
!834 = !DILocation(line: 744, column: 25, scope: !631)
!835 = !DILocation(line: 745, column: 26, scope: !631)
!836 = !DILocation(line: 745, column: 5, scope: !631)
!837 = !DILocation(line: 745, column: 14, scope: !631)
!838 = !DILocation(line: 745, column: 24, scope: !631)
!839 = !DILocation(line: 746, column: 1, scope: !631)
!840 = distinct !DISubprogram(name: "get_class", scope: !10, file: !10, line: 793, type: !148, scopeLine: 794, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!841 = !DILocalVariable(name: "class", arg: 1, scope: !840, file: !10, line: 793, type: !73)
!842 = !DILocation(line: 793, column: 15, scope: !840)
!843 = !DILocation(line: 795, column: 13, scope: !840)
!844 = !DILocation(line: 795, column: 5, scope: !840)
!845 = !DILocation(line: 796, column: 19, scope: !846)
!846 = distinct !DILexicalBlock(scope: !840, file: !10, line: 795, column: 20)
!847 = !DILocation(line: 797, column: 22, scope: !846)
!848 = !DILocation(line: 798, column: 19, scope: !846)
!849 = !DILocation(line: 799, column: 21, scope: !846)
!850 = !DILocation(line: 800, column: 20, scope: !846)
!851 = !DILocation(line: 801, column: 15, scope: !846)
!852 = !DILocation(line: 803, column: 1, scope: !840)
!853 = distinct !DISubprogram(name: "get_type", scope: !10, file: !10, line: 806, type: !148, scopeLine: 807, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!854 = !DILocalVariable(name: "type", arg: 1, scope: !853, file: !10, line: 806, type: !73)
!855 = !DILocation(line: 806, column: 14, scope: !853)
!856 = !DILocation(line: 808, column: 13, scope: !853)
!857 = !DILocation(line: 808, column: 5, scope: !853)
!858 = !DILocation(line: 809, column: 18, scope: !859)
!859 = distinct !DILexicalBlock(scope: !853, file: !10, line: 808, column: 19)
!860 = !DILocation(line: 810, column: 19, scope: !859)
!861 = !DILocation(line: 811, column: 22, scope: !859)
!862 = !DILocation(line: 812, column: 20, scope: !859)
!863 = !DILocation(line: 813, column: 20, scope: !859)
!864 = !DILocation(line: 814, column: 15, scope: !859)
!865 = !DILocation(line: 816, column: 1, scope: !853)
!866 = !DILocalVariable(name: "ttl", arg: 1, scope: !147, file: !10, line: 819, type: !73)
!867 = !DILocation(line: 819, column: 13, scope: !147)
!868 = !DILocation(line: 827, column: 15, scope: !147)
!869 = !DILocation(line: 828, column: 9, scope: !870)
!870 = distinct !DILexicalBlock(scope: !147, file: !10, line: 828, column: 9)
!871 = !DILocation(line: 828, column: 13, scope: !870)
!872 = !DILocation(line: 828, column: 9, scope: !147)
!873 = !DILocation(line: 829, column: 25, scope: !874)
!874 = distinct !DILexicalBlock(scope: !870, file: !10, line: 828, column: 27)
!875 = !DILocation(line: 829, column: 28, scope: !874)
!876 = !DILocation(line: 829, column: 2, scope: !874)
!877 = !DILocation(line: 830, column: 6, scope: !874)
!878 = !DILocation(line: 831, column: 5, scope: !874)
!879 = !DILocation(line: 832, column: 9, scope: !880)
!880 = distinct !DILexicalBlock(scope: !147, file: !10, line: 832, column: 9)
!881 = !DILocation(line: 832, column: 13, scope: !880)
!882 = !DILocation(line: 832, column: 9, scope: !147)
!883 = !DILocation(line: 833, column: 19, scope: !884)
!884 = distinct !DILexicalBlock(scope: !880, file: !10, line: 832, column: 25)
!885 = !DILocation(line: 833, column: 17, scope: !884)
!886 = !DILocation(line: 833, column: 42, scope: !884)
!887 = !DILocation(line: 833, column: 45, scope: !884)
!888 = !DILocation(line: 833, column: 2, scope: !884)
!889 = !DILocation(line: 834, column: 6, scope: !884)
!890 = !DILocation(line: 835, column: 5, scope: !884)
!891 = !DILocation(line: 836, column: 9, scope: !892)
!892 = distinct !DILexicalBlock(scope: !147, file: !10, line: 836, column: 9)
!893 = !DILocation(line: 836, column: 13, scope: !892)
!894 = !DILocation(line: 836, column: 9, scope: !147)
!895 = !DILocation(line: 837, column: 19, scope: !896)
!896 = distinct !DILexicalBlock(scope: !892, file: !10, line: 836, column: 22)
!897 = !DILocation(line: 837, column: 17, scope: !896)
!898 = !DILocation(line: 837, column: 42, scope: !896)
!899 = !DILocation(line: 837, column: 45, scope: !896)
!900 = !DILocation(line: 837, column: 2, scope: !896)
!901 = !DILocation(line: 838, column: 6, scope: !896)
!902 = !DILocation(line: 839, column: 5, scope: !896)
!903 = !DILocation(line: 840, column: 9, scope: !904)
!904 = distinct !DILexicalBlock(scope: !147, file: !10, line: 840, column: 9)
!905 = !DILocation(line: 840, column: 13, scope: !904)
!906 = !DILocation(line: 840, column: 9, scope: !147)
!907 = !DILocation(line: 841, column: 19, scope: !908)
!908 = distinct !DILexicalBlock(scope: !904, file: !10, line: 840, column: 19)
!909 = !DILocation(line: 841, column: 17, scope: !908)
!910 = !DILocation(line: 841, column: 42, scope: !908)
!911 = !DILocation(line: 841, column: 45, scope: !908)
!912 = !DILocation(line: 841, column: 2, scope: !908)
!913 = !DILocation(line: 842, column: 6, scope: !908)
!914 = !DILocation(line: 843, column: 5, scope: !908)
!915 = !DILocation(line: 844, column: 9, scope: !916)
!916 = distinct !DILexicalBlock(scope: !147, file: !10, line: 844, column: 9)
!917 = !DILocation(line: 844, column: 13, scope: !916)
!918 = !DILocation(line: 844, column: 9, scope: !147)
!919 = !DILocation(line: 845, column: 19, scope: !920)
!920 = distinct !DILexicalBlock(scope: !916, file: !10, line: 844, column: 18)
!921 = !DILocation(line: 845, column: 17, scope: !920)
!922 = !DILocation(line: 845, column: 42, scope: !920)
!923 = !DILocation(line: 845, column: 2, scope: !920)
!924 = !DILocation(line: 846, column: 5, scope: !920)
!925 = !DILocation(line: 848, column: 5, scope: !147)
!926 = distinct !DISubprogram(name: "dump_question", scope: !10, file: !10, line: 936, type: !927, scopeLine: 937, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !48}
!929 = !DILocalVariable(name: "question", arg: 1, scope: !926, file: !10, line: 936, type: !48)
!930 = !DILocation(line: 936, column: 35, scope: !926)
!931 = !DILocation(line: 938, column: 58, scope: !926)
!932 = !DILocation(line: 938, column: 68, scope: !926)
!933 = !DILocation(line: 938, column: 44, scope: !926)
!934 = !DILocation(line: 938, column: 5, scope: !926)
!935 = !DILocation(line: 940, column: 9, scope: !926)
!936 = !DILocation(line: 940, column: 19, scope: !926)
!937 = !DILocation(line: 940, column: 34, scope: !926)
!938 = !DILocation(line: 940, column: 44, scope: !926)
!939 = !DILocation(line: 940, column: 25, scope: !926)
!940 = !DILocation(line: 939, column: 5, scope: !926)
!941 = !DILocation(line: 942, column: 9, scope: !926)
!942 = !DILocation(line: 942, column: 19, scope: !926)
!943 = !DILocation(line: 942, column: 36, scope: !926)
!944 = !DILocation(line: 942, column: 46, scope: !926)
!945 = !DILocation(line: 942, column: 26, scope: !926)
!946 = !DILocation(line: 941, column: 5, scope: !926)
!947 = !DILocation(line: 943, column: 1, scope: !926)
!948 = distinct !DISubprogram(name: "dump_header", scope: !10, file: !10, line: 946, type: !949, scopeLine: 947, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!949 = !DISubroutineType(types: !950)
!950 = !{null, !25}
!951 = !DILocalVariable(name: "header", arg: 1, scope: !948, file: !10, line: 946, type: !25)
!952 = !DILocation(line: 946, column: 31, scope: !948)
!953 = !DILocation(line: 948, column: 49, scope: !948)
!954 = !DILocation(line: 948, column: 57, scope: !948)
!955 = !DILocation(line: 948, column: 5, scope: !948)
!956 = !DILocation(line: 949, column: 49, scope: !948)
!957 = !DILocation(line: 949, column: 57, scope: !948)
!958 = !DILocation(line: 949, column: 63, scope: !948)
!959 = !DILocation(line: 949, column: 5, scope: !948)
!960 = !DILocation(line: 951, column: 9, scope: !961)
!961 = distinct !DILexicalBlock(scope: !948, file: !10, line: 951, column: 9)
!962 = !DILocation(line: 951, column: 17, scope: !961)
!963 = !DILocation(line: 951, column: 23, scope: !961)
!964 = !DILocation(line: 951, column: 27, scope: !961)
!965 = !DILocation(line: 951, column: 9, scope: !948)
!966 = !DILocation(line: 951, column: 31, scope: !961)
!967 = !DILocation(line: 951, column: 50, scope: !961)
!968 = !DILocation(line: 952, column: 9, scope: !969)
!969 = distinct !DILexicalBlock(scope: !948, file: !10, line: 952, column: 9)
!970 = !DILocation(line: 952, column: 17, scope: !969)
!971 = !DILocation(line: 952, column: 23, scope: !969)
!972 = !DILocation(line: 952, column: 27, scope: !969)
!973 = !DILocation(line: 952, column: 9, scope: !948)
!974 = !DILocation(line: 952, column: 31, scope: !969)
!975 = !DILocation(line: 953, column: 9, scope: !976)
!976 = distinct !DILexicalBlock(scope: !948, file: !10, line: 953, column: 9)
!977 = !DILocation(line: 953, column: 17, scope: !976)
!978 = !DILocation(line: 953, column: 23, scope: !976)
!979 = !DILocation(line: 953, column: 27, scope: !976)
!980 = !DILocation(line: 953, column: 9, scope: !948)
!981 = !DILocation(line: 953, column: 31, scope: !976)
!982 = !DILocation(line: 954, column: 9, scope: !983)
!983 = distinct !DILexicalBlock(scope: !948, file: !10, line: 954, column: 9)
!984 = !DILocation(line: 954, column: 17, scope: !983)
!985 = !DILocation(line: 954, column: 23, scope: !983)
!986 = !DILocation(line: 954, column: 27, scope: !983)
!987 = !DILocation(line: 954, column: 9, scope: !948)
!988 = !DILocation(line: 954, column: 31, scope: !983)
!989 = !DILocation(line: 955, column: 9, scope: !990)
!990 = distinct !DILexicalBlock(scope: !948, file: !10, line: 955, column: 9)
!991 = !DILocation(line: 955, column: 17, scope: !990)
!992 = !DILocation(line: 955, column: 23, scope: !990)
!993 = !DILocation(line: 955, column: 27, scope: !990)
!994 = !DILocation(line: 955, column: 9, scope: !948)
!995 = !DILocation(line: 955, column: 31, scope: !990)
!996 = !DILocation(line: 956, column: 5, scope: !948)
!997 = !DILocation(line: 958, column: 44, scope: !948)
!998 = !DILocation(line: 958, column: 52, scope: !948)
!999 = !DILocation(line: 958, column: 58, scope: !948)
!1000 = !DILocation(line: 958, column: 62, scope: !948)
!1001 = !DILocation(line: 958, column: 5, scope: !948)
!1002 = !DILocation(line: 959, column: 13, scope: !948)
!1003 = !DILocation(line: 959, column: 21, scope: !948)
!1004 = !DILocation(line: 959, column: 27, scope: !948)
!1005 = !DILocation(line: 959, column: 31, scope: !948)
!1006 = !DILocation(line: 959, column: 5, scope: !948)
!1007 = !DILocation(line: 960, column: 13, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !948, file: !10, line: 959, column: 39)
!1009 = !DILocation(line: 960, column: 42, scope: !1008)
!1010 = !DILocation(line: 961, column: 13, scope: !1008)
!1011 = !DILocation(line: 961, column: 41, scope: !1008)
!1012 = !DILocation(line: 962, column: 13, scope: !1008)
!1013 = !DILocation(line: 962, column: 49, scope: !1008)
!1014 = !DILocation(line: 963, column: 13, scope: !1008)
!1015 = !DILocation(line: 963, column: 34, scope: !1008)
!1016 = !DILocation(line: 964, column: 13, scope: !1008)
!1017 = !DILocation(line: 964, column: 34, scope: !1008)
!1018 = !DILocation(line: 965, column: 14, scope: !1008)
!1019 = !DILocation(line: 965, column: 38, scope: !1008)
!1020 = !DILocation(line: 966, column: 14, scope: !1008)
!1021 = !DILocation(line: 966, column: 37, scope: !1008)
!1022 = !DILocation(line: 967, column: 14, scope: !1008)
!1023 = !DILocation(line: 968, column: 5, scope: !1008)
!1024 = !DILocation(line: 970, column: 44, scope: !948)
!1025 = !DILocation(line: 970, column: 52, scope: !948)
!1026 = !DILocation(line: 970, column: 58, scope: !948)
!1027 = !DILocation(line: 970, column: 62, scope: !948)
!1028 = !DILocation(line: 970, column: 5, scope: !948)
!1029 = !DILocation(line: 971, column: 13, scope: !948)
!1030 = !DILocation(line: 971, column: 21, scope: !948)
!1031 = !DILocation(line: 971, column: 27, scope: !948)
!1032 = !DILocation(line: 971, column: 31, scope: !948)
!1033 = !DILocation(line: 971, column: 5, scope: !948)
!1034 = !DILocation(line: 972, column: 13, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !948, file: !10, line: 971, column: 38)
!1036 = !DILocation(line: 972, column: 36, scope: !1035)
!1037 = !DILocation(line: 973, column: 13, scope: !1035)
!1038 = !DILocation(line: 973, column: 40, scope: !1035)
!1039 = !DILocation(line: 974, column: 13, scope: !1035)
!1040 = !DILocation(line: 974, column: 42, scope: !1035)
!1041 = !DILocation(line: 975, column: 13, scope: !1035)
!1042 = !DILocation(line: 975, column: 38, scope: !1035)
!1043 = !DILocation(line: 976, column: 13, scope: !1035)
!1044 = !DILocation(line: 976, column: 43, scope: !1035)
!1045 = !DILocation(line: 977, column: 13, scope: !1035)
!1046 = !DILocation(line: 977, column: 35, scope: !1035)
!1047 = !DILocation(line: 978, column: 13, scope: !1035)
!1048 = !DILocation(line: 978, column: 39, scope: !1035)
!1049 = !DILocation(line: 979, column: 13, scope: !1035)
!1050 = !DILocation(line: 979, column: 40, scope: !1035)
!1051 = !DILocation(line: 980, column: 13, scope: !1035)
!1052 = !DILocation(line: 980, column: 48, scope: !1035)
!1053 = !DILocation(line: 981, column: 13, scope: !1035)
!1054 = !DILocation(line: 981, column: 43, scope: !1035)
!1055 = !DILocation(line: 982, column: 14, scope: !1035)
!1056 = !DILocation(line: 982, column: 71, scope: !1035)
!1057 = !DILocation(line: 983, column: 14, scope: !1035)
!1058 = !DILocation(line: 983, column: 36, scope: !1035)
!1059 = !DILocation(line: 986, column: 45, scope: !948)
!1060 = !DILocation(line: 986, column: 53, scope: !948)
!1061 = !DILocation(line: 986, column: 5, scope: !948)
!1062 = !DILocation(line: 987, column: 45, scope: !948)
!1063 = !DILocation(line: 987, column: 53, scope: !948)
!1064 = !DILocation(line: 987, column: 5, scope: !948)
!1065 = !DILocation(line: 988, column: 45, scope: !948)
!1066 = !DILocation(line: 988, column: 53, scope: !948)
!1067 = !DILocation(line: 988, column: 5, scope: !948)
!1068 = !DILocation(line: 989, column: 45, scope: !948)
!1069 = !DILocation(line: 989, column: 53, scope: !948)
!1070 = !DILocation(line: 989, column: 5, scope: !948)
!1071 = !DILocation(line: 990, column: 1, scope: !948)
!1072 = distinct !DISubprogram(name: "dump_rr", scope: !10, file: !10, line: 993, type: !1073, scopeLine: 994, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{null, !8, !87}
!1075 = !DILocalVariable(name: "rr", arg: 1, scope: !1072, file: !10, line: 993, type: !8)
!1076 = !DILocation(line: 993, column: 23, scope: !1072)
!1077 = !DILocalVariable(name: "session", arg: 2, scope: !1072, file: !10, line: 993, type: !87)
!1078 = !DILocation(line: 993, column: 46, scope: !1072)
!1079 = !DILocation(line: 995, column: 58, scope: !1072)
!1080 = !DILocation(line: 995, column: 62, scope: !1072)
!1081 = !DILocation(line: 995, column: 44, scope: !1072)
!1082 = !DILocation(line: 995, column: 5, scope: !1072)
!1083 = !DILocation(line: 997, column: 9, scope: !1072)
!1084 = !DILocation(line: 997, column: 13, scope: !1072)
!1085 = !DILocation(line: 997, column: 28, scope: !1072)
!1086 = !DILocation(line: 997, column: 32, scope: !1072)
!1087 = !DILocation(line: 997, column: 19, scope: !1072)
!1088 = !DILocation(line: 996, column: 5, scope: !1072)
!1089 = !DILocation(line: 999, column: 9, scope: !1072)
!1090 = !DILocation(line: 999, column: 13, scope: !1072)
!1091 = !DILocation(line: 999, column: 30, scope: !1072)
!1092 = !DILocation(line: 999, column: 34, scope: !1072)
!1093 = !DILocation(line: 999, column: 20, scope: !1072)
!1094 = !DILocation(line: 998, column: 5, scope: !1072)
!1095 = !DILocation(line: 1001, column: 9, scope: !1072)
!1096 = !DILocation(line: 1001, column: 13, scope: !1072)
!1097 = !DILocation(line: 1001, column: 26, scope: !1072)
!1098 = !DILocation(line: 1001, column: 30, scope: !1072)
!1099 = !DILocation(line: 1001, column: 18, scope: !1072)
!1100 = !DILocation(line: 1000, column: 5, scope: !1072)
!1101 = !DILocation(line: 1002, column: 45, scope: !1072)
!1102 = !DILocation(line: 1002, column: 49, scope: !1072)
!1103 = !DILocation(line: 1002, column: 5, scope: !1072)
!1104 = !DILocation(line: 1004, column: 22, scope: !1072)
!1105 = !DILocation(line: 1004, column: 26, scope: !1072)
!1106 = !DILocation(line: 1004, column: 32, scope: !1072)
!1107 = !DILocation(line: 1004, column: 41, scope: !1072)
!1108 = !DILocation(line: 1004, column: 45, scope: !1072)
!1109 = !DILocation(line: 1004, column: 9, scope: !1072)
!1110 = !DILocation(line: 1003, column: 5, scope: !1072)
!1111 = !DILocation(line: 1005, column: 1, scope: !1072)
!1112 = distinct !DISubprogram(name: "dump_data", scope: !10, file: !10, line: 1008, type: !1113, scopeLine: 1009, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{null, !1115, !1131, !87}
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 32)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !1117, line: 11, size: 128, elements: !1118)
!1117 = !DIFile(filename: "/data/wasi-sdk/build/wasi-sdk-14.0/share/wasi-sysroot/include/__struct_sockaddr_in.h", directory: "")
!1118 = !{!1119, !1121, !1124}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !1116, file: !1117, line: 12, baseType: !1120, size: 16, align: 128)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !176, line: 417, baseType: !17)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !1116, file: !1117, line: 13, baseType: !1122, size: 16, offset: 16)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !1123, line: 4, baseType: !17)
!1123 = !DIFile(filename: "/data/wasi-sdk/build/wasi-sdk-14.0/share/wasi-sysroot/include/__typedef_in_port_t.h", directory: "")
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !1116, file: !1117, line: 14, baseType: !1125, size: 32, offset: 32)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !1126, line: 6, size: 32, elements: !1127)
!1126 = !DIFile(filename: "/data/wasi-sdk/build/wasi-sdk-14.0/share/wasi-sysroot/include/__struct_in_addr.h", directory: "")
!1127 = !{!1128}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !1125, file: !1126, line: 7, baseType: !1129, size: 32)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !1130, line: 4, baseType: !20)
!1130 = !DIFile(filename: "/data/wasi-sdk/build/wasi-sdk-14.0/share/wasi-sysroot/include/__typedef_in_addr_t.h", directory: "")
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 32)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !1133, line: 11, size: 256, elements: !1134)
!1133 = !DIFile(filename: "/data/wasi-sdk/build/wasi-sdk-14.0/share/wasi-sysroot/include/__struct_sockaddr_in6.h", directory: "")
!1134 = !{!1135, !1136, !1137, !1138, !1146}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !1132, file: !1133, line: 12, baseType: !1120, size: 16, align: 128)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !1132, file: !1133, line: 13, baseType: !1122, size: 16, offset: 16)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !1132, file: !1133, line: 14, baseType: !20, size: 32, offset: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !1132, file: !1133, line: 15, baseType: !1139, size: 128, offset: 64)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !1140, line: 4, size: 128, elements: !1141)
!1140 = !DIFile(filename: "/data/wasi-sdk/build/wasi-sdk-14.0/share/wasi-sysroot/include/__struct_in6_addr.h", directory: "")
!1141 = !{!1142}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "s6_addr", scope: !1139, file: !1140, line: 5, baseType: !1143, size: 128, align: 32)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 128, elements: !1144)
!1144 = !{!1145}
!1145 = !DISubrange(count: 16)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !1132, file: !1133, line: 16, baseType: !20, size: 32, offset: 192)
!1147 = !DILocalVariable(name: "dest4", arg: 1, scope: !1112, file: !10, line: 1008, type: !1115)
!1148 = !DILocation(line: 1008, column: 31, scope: !1112)
!1149 = !DILocalVariable(name: "dest6", arg: 2, scope: !1112, file: !10, line: 1008, type: !1131)
!1150 = !DILocation(line: 1008, column: 59, scope: !1112)
!1151 = !DILocalVariable(name: "session", arg: 3, scope: !1112, file: !10, line: 1008, type: !87)
!1152 = !DILocation(line: 1008, column: 85, scope: !1112)
!1153 = !DILocalVariable(name: "answerrr", scope: !1112, file: !10, line: 1010, type: !8)
!1154 = !DILocation(line: 1010, column: 19, scope: !1112)
!1155 = !DILocalVariable(name: "authorityrr", scope: !1112, file: !10, line: 1011, type: !8)
!1156 = !DILocation(line: 1011, column: 19, scope: !1112)
!1157 = !DILocalVariable(name: "additionalrr", scope: !1112, file: !10, line: 1012, type: !8)
!1158 = !DILocation(line: 1012, column: 19, scope: !1112)
!1159 = !DILocation(line: 1014, column: 9, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1112, file: !10, line: 1014, column: 9)
!1161 = !DILocation(line: 1014, column: 17, scope: !1160)
!1162 = !DILocation(line: 1014, column: 9, scope: !1112)
!1163 = !DILocation(line: 1014, column: 23, scope: !1160)
!1164 = !DILocation(line: 1020, column: 9, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1112, file: !10, line: 1020, column: 9)
!1166 = !DILocation(line: 1020, column: 15, scope: !1165)
!1167 = !DILocation(line: 1020, column: 9, scope: !1112)
!1168 = !DILocation(line: 1021, column: 2, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1165, file: !10, line: 1020, column: 24)
!1170 = !DILocation(line: 1022, column: 51, scope: !1169)
!1171 = !DILocation(line: 1022, column: 58, scope: !1169)
!1172 = !DILocation(line: 1022, column: 41, scope: !1169)
!1173 = !DILocation(line: 1022, column: 2, scope: !1169)
!1174 = !DILocation(line: 1023, column: 5, scope: !1169)
!1175 = !DILocation(line: 1024, column: 9, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1112, file: !10, line: 1024, column: 9)
!1177 = !DILocation(line: 1024, column: 15, scope: !1176)
!1178 = !DILocation(line: 1024, column: 9, scope: !1112)
!1179 = !DILocation(line: 1025, column: 2, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1176, file: !10, line: 1024, column: 24)
!1181 = !DILocation(line: 1026, column: 2, scope: !1180)
!1182 = !DILocation(line: 1027, column: 5, scope: !1180)
!1183 = !DILocation(line: 1029, column: 9, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1112, file: !10, line: 1029, column: 9)
!1185 = !DILocation(line: 1029, column: 18, scope: !1184)
!1186 = !DILocation(line: 1029, column: 30, scope: !1184)
!1187 = !DILocation(line: 1029, column: 38, scope: !1184)
!1188 = !DILocation(line: 1029, column: 41, scope: !1184)
!1189 = !DILocation(line: 1029, column: 50, scope: !1184)
!1190 = !DILocation(line: 1029, column: 62, scope: !1184)
!1191 = !DILocation(line: 1029, column: 9, scope: !1112)
!1192 = !DILocation(line: 1030, column: 2, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1184, file: !10, line: 1029, column: 71)
!1194 = !DILocation(line: 1031, column: 14, scope: !1193)
!1195 = !DILocation(line: 1031, column: 23, scope: !1193)
!1196 = !DILocation(line: 1031, column: 2, scope: !1193)
!1197 = !DILocation(line: 1032, column: 5, scope: !1193)
!1198 = !DILocation(line: 1034, column: 9, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1112, file: !10, line: 1034, column: 9)
!1200 = !DILocation(line: 1034, column: 18, scope: !1199)
!1201 = !DILocation(line: 1034, column: 30, scope: !1199)
!1202 = !DILocation(line: 1034, column: 9, scope: !1112)
!1203 = !DILocation(line: 1035, column: 2, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1199, file: !10, line: 1034, column: 39)
!1205 = !DILocation(line: 1036, column: 14, scope: !1204)
!1206 = !DILocation(line: 1036, column: 23, scope: !1204)
!1207 = !DILocation(line: 1036, column: 2, scope: !1204)
!1208 = !DILocation(line: 1037, column: 5, scope: !1204)
!1209 = !DILocation(line: 1039, column: 9, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1112, file: !10, line: 1039, column: 9)
!1211 = !DILocation(line: 1039, column: 18, scope: !1210)
!1212 = !DILocation(line: 1039, column: 32, scope: !1210)
!1213 = !DILocation(line: 1039, column: 40, scope: !1210)
!1214 = !DILocation(line: 1039, column: 43, scope: !1210)
!1215 = !DILocation(line: 1039, column: 52, scope: !1210)
!1216 = !DILocation(line: 1039, column: 66, scope: !1210)
!1217 = !DILocation(line: 1039, column: 9, scope: !1112)
!1218 = !DILocation(line: 1040, column: 2, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1210, file: !10, line: 1039, column: 75)
!1220 = !DILocation(line: 1041, column: 16, scope: !1219)
!1221 = !DILocation(line: 1041, column: 25, scope: !1219)
!1222 = !DILocation(line: 1041, column: 2, scope: !1219)
!1223 = !DILocation(line: 1042, column: 5, scope: !1219)
!1224 = !DILocation(line: 1043, column: 9, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1112, file: !10, line: 1043, column: 9)
!1226 = !DILocation(line: 1043, column: 18, scope: !1225)
!1227 = !DILocation(line: 1043, column: 32, scope: !1225)
!1228 = !DILocation(line: 1043, column: 9, scope: !1112)
!1229 = !DILocation(line: 1044, column: 2, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1225, file: !10, line: 1043, column: 41)
!1231 = !DILocation(line: 1045, column: 16, scope: !1230)
!1232 = !DILocation(line: 1045, column: 25, scope: !1230)
!1233 = !DILocation(line: 1045, column: 2, scope: !1230)
!1234 = !DILocation(line: 1046, column: 5, scope: !1230)
!1235 = !DILocation(line: 1048, column: 16, scope: !1112)
!1236 = !DILocation(line: 1048, column: 25, scope: !1112)
!1237 = !DILocation(line: 1048, column: 14, scope: !1112)
!1238 = !DILocation(line: 1049, column: 5, scope: !1112)
!1239 = !DILocation(line: 1049, column: 12, scope: !1112)
!1240 = !DILocation(line: 1049, column: 21, scope: !1112)
!1241 = !DILocation(line: 1050, column: 2, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1112, file: !10, line: 1049, column: 30)
!1243 = !DILocation(line: 1051, column: 10, scope: !1242)
!1244 = !DILocation(line: 1051, column: 20, scope: !1242)
!1245 = !DILocation(line: 1051, column: 2, scope: !1242)
!1246 = !DILocation(line: 1052, column: 13, scope: !1242)
!1247 = !DILocation(line: 1052, column: 23, scope: !1242)
!1248 = !DILocation(line: 1052, column: 11, scope: !1242)
!1249 = distinct !{!1249, !1238, !1250, !309}
!1250 = !DILocation(line: 1053, column: 5, scope: !1112)
!1251 = !DILocation(line: 1055, column: 19, scope: !1112)
!1252 = !DILocation(line: 1055, column: 28, scope: !1112)
!1253 = !DILocation(line: 1055, column: 17, scope: !1112)
!1254 = !DILocation(line: 1056, column: 5, scope: !1112)
!1255 = !DILocation(line: 1056, column: 12, scope: !1112)
!1256 = !DILocation(line: 1056, column: 24, scope: !1112)
!1257 = !DILocation(line: 1057, column: 2, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1112, file: !10, line: 1056, column: 33)
!1259 = !DILocation(line: 1058, column: 10, scope: !1258)
!1260 = !DILocation(line: 1058, column: 23, scope: !1258)
!1261 = !DILocation(line: 1058, column: 2, scope: !1258)
!1262 = !DILocation(line: 1059, column: 16, scope: !1258)
!1263 = !DILocation(line: 1059, column: 29, scope: !1258)
!1264 = !DILocation(line: 1059, column: 14, scope: !1258)
!1265 = distinct !{!1265, !1254, !1266, !309}
!1266 = !DILocation(line: 1060, column: 5, scope: !1112)
!1267 = !DILocation(line: 1062, column: 20, scope: !1112)
!1268 = !DILocation(line: 1062, column: 29, scope: !1112)
!1269 = !DILocation(line: 1062, column: 18, scope: !1112)
!1270 = !DILocation(line: 1063, column: 5, scope: !1112)
!1271 = !DILocation(line: 1063, column: 12, scope: !1112)
!1272 = !DILocation(line: 1063, column: 25, scope: !1112)
!1273 = !DILocation(line: 1064, column: 2, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1112, file: !10, line: 1063, column: 34)
!1275 = !DILocation(line: 1065, column: 10, scope: !1274)
!1276 = !DILocation(line: 1065, column: 24, scope: !1274)
!1277 = !DILocation(line: 1065, column: 2, scope: !1274)
!1278 = !DILocation(line: 1066, column: 17, scope: !1274)
!1279 = !DILocation(line: 1066, column: 31, scope: !1274)
!1280 = !DILocation(line: 1066, column: 15, scope: !1274)
!1281 = distinct !{!1281, !1270, !1282, !309}
!1282 = !DILocation(line: 1067, column: 5, scope: !1112)
!1283 = !DILocation(line: 1068, column: 1, scope: !1112)
!1284 = distinct !DISubprogram(name: "create_packet", scope: !10, file: !10, line: 1077, type: !1285, scopeLine: 1078, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!13, !87}
!1287 = !DILocalVariable(name: "session", arg: 1, scope: !1284, file: !10, line: 1077, type: !87)
!1288 = !DILocation(line: 1077, column: 34, scope: !1284)
!1289 = !DILocalVariable(name: "pkt", scope: !1284, file: !10, line: 1079, type: !13)
!1290 = !DILocation(line: 1079, column: 21, scope: !1284)
!1291 = !DILocalVariable(name: "nheader", scope: !1284, file: !10, line: 1080, type: !26)
!1292 = !DILocation(line: 1080, column: 22, scope: !1284)
!1293 = !DILocalVariable(name: "nquestion", scope: !1284, file: !10, line: 1081, type: !49)
!1294 = !DILocation(line: 1081, column: 24, scope: !1284)
!1295 = !DILocalVariable(name: "len", scope: !1284, file: !10, line: 1082, type: !73)
!1296 = !DILocation(line: 1082, column: 11, scope: !1284)
!1297 = !DILocation(line: 1089, column: 38, scope: !1284)
!1298 = !DILocation(line: 1089, column: 47, scope: !1284)
!1299 = !DILocation(line: 1089, column: 62, scope: !1284)
!1300 = !DILocation(line: 1089, column: 36, scope: !1284)
!1301 = !DILocation(line: 1089, column: 74, scope: !1284)
!1302 = !DILocation(line: 1089, column: 9, scope: !1284)
!1303 = !DILocation(line: 1090, column: 38, scope: !1284)
!1304 = !DILocation(line: 1090, column: 28, scope: !1284)
!1305 = !DILocation(line: 1090, column: 9, scope: !1284)
!1306 = !DILocation(line: 1092, column: 5, scope: !1284)
!1307 = !DILocation(line: 1092, column: 22, scope: !1284)
!1308 = !DILocation(line: 1092, column: 31, scope: !1284)
!1309 = !DILocation(line: 1093, column: 5, scope: !1284)
!1310 = !DILocation(line: 1093, column: 24, scope: !1284)
!1311 = !DILocation(line: 1093, column: 33, scope: !1284)
!1312 = !DILocation(line: 1095, column: 36, scope: !1284)
!1313 = !DILocation(line: 1095, column: 45, scope: !1284)
!1314 = !DILocation(line: 1095, column: 58, scope: !1284)
!1315 = !DILocation(line: 1095, column: 30, scope: !1284)
!1316 = !DILocation(line: 1095, column: 13, scope: !1284)
!1317 = !DILocation(line: 1095, column: 28, scope: !1284)
!1318 = !DILocation(line: 1096, column: 33, scope: !1284)
!1319 = !DILocation(line: 1096, column: 42, scope: !1284)
!1320 = !DILocation(line: 1096, column: 55, scope: !1284)
!1321 = !DILocation(line: 1096, column: 61, scope: !1284)
!1322 = !DILocation(line: 1096, column: 27, scope: !1284)
!1323 = !DILocation(line: 1096, column: 13, scope: !1284)
!1324 = !DILocation(line: 1096, column: 19, scope: !1284)
!1325 = !DILocation(line: 1096, column: 25, scope: !1284)
!1326 = !DILocation(line: 1097, column: 32, scope: !1284)
!1327 = !DILocation(line: 1097, column: 41, scope: !1284)
!1328 = !DILocation(line: 1097, column: 54, scope: !1284)
!1329 = !DILocation(line: 1097, column: 26, scope: !1284)
!1330 = !DILocation(line: 1097, column: 13, scope: !1284)
!1331 = !DILocation(line: 1097, column: 24, scope: !1284)
!1332 = !DILocation(line: 1098, column: 31, scope: !1284)
!1333 = !DILocation(line: 1098, column: 40, scope: !1284)
!1334 = !DILocation(line: 1098, column: 53, scope: !1284)
!1335 = !DILocation(line: 1098, column: 25, scope: !1284)
!1336 = !DILocation(line: 1098, column: 13, scope: !1284)
!1337 = !DILocation(line: 1098, column: 23, scope: !1284)
!1338 = !DILocation(line: 1099, column: 34, scope: !1284)
!1339 = !DILocation(line: 1099, column: 43, scope: !1284)
!1340 = !DILocation(line: 1099, column: 56, scope: !1284)
!1341 = !DILocation(line: 1099, column: 28, scope: !1284)
!1342 = !DILocation(line: 1099, column: 13, scope: !1284)
!1343 = !DILocation(line: 1099, column: 26, scope: !1284)
!1344 = !DILocation(line: 1100, column: 35, scope: !1284)
!1345 = !DILocation(line: 1100, column: 44, scope: !1284)
!1346 = !DILocation(line: 1100, column: 57, scope: !1284)
!1347 = !DILocation(line: 1100, column: 29, scope: !1284)
!1348 = !DILocation(line: 1100, column: 13, scope: !1284)
!1349 = !DILocation(line: 1100, column: 27, scope: !1284)
!1350 = !DILocation(line: 1102, column: 28, scope: !1284)
!1351 = !DILocation(line: 1102, column: 37, scope: !1284)
!1352 = !DILocation(line: 1102, column: 52, scope: !1284)
!1353 = !DILocation(line: 1102, column: 22, scope: !1284)
!1354 = !DILocation(line: 1102, column: 15, scope: !1284)
!1355 = !DILocation(line: 1102, column: 20, scope: !1284)
!1356 = !DILocation(line: 1103, column: 29, scope: !1284)
!1357 = !DILocation(line: 1103, column: 38, scope: !1284)
!1358 = !DILocation(line: 1103, column: 53, scope: !1284)
!1359 = !DILocation(line: 1103, column: 23, scope: !1284)
!1360 = !DILocation(line: 1103, column: 15, scope: !1284)
!1361 = !DILocation(line: 1103, column: 21, scope: !1284)
!1362 = !DILocation(line: 1105, column: 12, scope: !1284)
!1363 = !DILocation(line: 1105, column: 5, scope: !1284)
!1364 = !DILocation(line: 1106, column: 12, scope: !1284)
!1365 = !DILocation(line: 1106, column: 16, scope: !1284)
!1366 = !DILocation(line: 1106, column: 54, scope: !1284)
!1367 = !DILocation(line: 1106, column: 71, scope: !1284)
!1368 = !DILocation(line: 1106, column: 5, scope: !1284)
!1369 = !DILocation(line: 1107, column: 12, scope: !1284)
!1370 = !DILocation(line: 1107, column: 16, scope: !1284)
!1371 = !DILocation(line: 1107, column: 55, scope: !1284)
!1372 = !DILocation(line: 1107, column: 43, scope: !1284)
!1373 = !DILocation(line: 1107, column: 80, scope: !1284)
!1374 = !DILocation(line: 1107, column: 5, scope: !1284)
!1375 = !DILocation(line: 1109, column: 12, scope: !1284)
!1376 = !DILocation(line: 1109, column: 5, scope: !1284)
!1377 = distinct !DISubprogram(name: "create_socket", scope: !10, file: !10, line: 1119, type: !1378, scopeLine: 1120, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1378 = !DISubroutineType(types: !1379)
!1379 = !{!73, !73}
!1380 = !DILocalVariable(name: "PF", arg: 1, scope: !1377, file: !10, line: 1119, type: !73)
!1381 = !DILocation(line: 1119, column: 19, scope: !1377)
!1382 = !DILocalVariable(name: "s", scope: !1377, file: !10, line: 1121, type: !73)
!1383 = !DILocation(line: 1121, column: 9, scope: !1377)
!1384 = !DILocation(line: 1123, column: 21, scope: !1385)
!1385 = distinct !DILexicalBlock(scope: !1377, file: !10, line: 1123, column: 9)
!1386 = !DILocation(line: 1123, column: 14, scope: !1385)
!1387 = !DILocation(line: 1123, column: 12, scope: !1385)
!1388 = !DILocation(line: 1123, column: 41, scope: !1385)
!1389 = !DILocation(line: 1123, column: 9, scope: !1377)
!1390 = !DILocation(line: 1124, column: 2, scope: !1391)
!1391 = distinct !DILexicalBlock(scope: !1385, file: !10, line: 1123, column: 46)
!1392 = !DILocation(line: 1125, column: 2, scope: !1391)
!1393 = !DILocation(line: 1126, column: 2, scope: !1391)
!1394 = !DILocation(line: 1129, column: 9, scope: !1395)
!1395 = distinct !DILexicalBlock(scope: !1377, file: !10, line: 1129, column: 9)
!1396 = !DILocation(line: 1129, column: 31, scope: !1395)
!1397 = !DILocation(line: 1129, column: 9, scope: !1377)
!1398 = !DILocalVariable(name: "hints", scope: !1399, file: !10, line: 1130, type: !1400)
!1399 = distinct !DILexicalBlock(scope: !1395, file: !10, line: 1129, column: 40)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !10, line: 170, size: 256, elements: !1401)
!1401 = !{!1402, !1403, !1404, !1405, !1406, !1408, !1409, !1410}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !1400, file: !10, line: 171, baseType: !73, size: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !1400, file: !10, line: 172, baseType: !73, size: 32, offset: 32)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !1400, file: !10, line: 173, baseType: !73, size: 32, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !1400, file: !10, line: 174, baseType: !73, size: 32, offset: 96)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !1400, file: !10, line: 175, baseType: !1407, size: 32, offset: 128)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !176, line: 412, baseType: !20)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !1400, file: !10, line: 176, baseType: !6, size: 32, offset: 160)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !1400, file: !10, line: 177, baseType: !56, size: 32, offset: 192)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !1400, file: !10, line: 178, baseType: !1411, size: 32, offset: 224)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 32)
!1412 = !DILocation(line: 1130, column: 18, scope: !1399)
!1413 = !DILocalVariable(name: "src_res", scope: !1399, file: !10, line: 1130, type: !1411)
!1414 = !DILocation(line: 1130, column: 26, scope: !1399)
!1415 = !DILocalVariable(name: "error", scope: !1399, file: !10, line: 1131, type: !73)
!1416 = !DILocation(line: 1131, column: 6, scope: !1399)
!1417 = !DILocation(line: 1134, column: 9, scope: !1399)
!1418 = !DILocation(line: 1135, column: 15, scope: !1399)
!1419 = !DILocation(line: 1135, column: 24, scope: !1399)
!1420 = !DILocation(line: 1136, column: 15, scope: !1399)
!1421 = !DILocation(line: 1136, column: 25, scope: !1399)
!1422 = !DILocation(line: 1137, column: 15, scope: !1399)
!1423 = !DILocation(line: 1137, column: 27, scope: !1399)
!1424 = !DILocation(line: 1138, column: 29, scope: !1399)
!1425 = !DILocation(line: 1138, column: 55, scope: !1399)
!1426 = !DILocation(line: 1138, column: 63, scope: !1399)
!1427 = !DILocation(line: 1138, column: 17, scope: !1399)
!1428 = !DILocation(line: 1138, column: 15, scope: !1399)
!1429 = !DILocation(line: 1139, column: 13, scope: !1430)
!1430 = distinct !DILexicalBlock(scope: !1399, file: !10, line: 1139, column: 13)
!1431 = !DILocation(line: 1139, column: 19, scope: !1430)
!1432 = !DILocation(line: 1139, column: 13, scope: !1399)
!1433 = !DILocation(line: 1140, column: 12, scope: !1434)
!1434 = distinct !DILexicalBlock(scope: !1430, file: !10, line: 1139, column: 34)
!1435 = !DILocation(line: 1140, column: 21, scope: !1434)
!1436 = !DILocation(line: 1141, column: 26, scope: !1434)
!1437 = !DILocation(line: 1141, column: 52, scope: !1434)
!1438 = !DILocation(line: 1141, column: 60, scope: !1434)
!1439 = !DILocation(line: 1141, column: 14, scope: !1434)
!1440 = !DILocation(line: 1141, column: 12, scope: !1434)
!1441 = !DILocation(line: 1142, column: 9, scope: !1434)
!1442 = !DILocation(line: 1143, column: 13, scope: !1443)
!1443 = distinct !DILexicalBlock(scope: !1399, file: !10, line: 1143, column: 13)
!1444 = !DILocation(line: 1143, column: 19, scope: !1443)
!1445 = !DILocation(line: 1143, column: 13, scope: !1399)
!1446 = !DILocation(line: 1144, column: 13, scope: !1447)
!1447 = distinct !DILexicalBlock(scope: !1443, file: !10, line: 1143, column: 25)
!1448 = !DILocation(line: 1144, column: 6, scope: !1447)
!1449 = !DILocation(line: 1145, column: 10, scope: !1450)
!1450 = distinct !DILexicalBlock(scope: !1447, file: !10, line: 1145, column: 10)
!1451 = !DILocation(line: 1145, column: 16, scope: !1450)
!1452 = !DILocation(line: 1145, column: 10, scope: !1447)
!1453 = !DILocation(line: 1146, column: 10, scope: !1450)
!1454 = !DILocation(line: 1146, column: 3, scope: !1450)
!1455 = !DILocation(line: 1147, column: 6, scope: !1447)
!1456 = !DILocation(line: 1150, column: 11, scope: !1457)
!1457 = distinct !DILexicalBlock(scope: !1399, file: !10, line: 1150, column: 6)
!1458 = !DILocation(line: 1150, column: 14, scope: !1457)
!1459 = !DILocation(line: 1150, column: 23, scope: !1457)
!1460 = !DILocation(line: 1150, column: 32, scope: !1457)
!1461 = !DILocation(line: 1150, column: 41, scope: !1457)
!1462 = !DILocation(line: 1150, column: 6, scope: !1457)
!1463 = !DILocation(line: 1150, column: 53, scope: !1457)
!1464 = !DILocation(line: 1150, column: 6, scope: !1399)
!1465 = !DILocation(line: 1151, column: 6, scope: !1466)
!1466 = distinct !DILexicalBlock(scope: !1457, file: !10, line: 1150, column: 58)
!1467 = !DILocation(line: 1152, column: 6, scope: !1466)
!1468 = !DILocation(line: 1154, column: 5, scope: !1399)
!1469 = !DILocation(line: 1156, column: 12, scope: !1377)
!1470 = !DILocation(line: 1156, column: 5, scope: !1377)
!1471 = distinct !DISubprogram(name: "send_data", scope: !10, file: !10, line: 1160, type: !1472, scopeLine: 1161, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{!73, !6, !87}
!1474 = !DILocalVariable(name: "server", arg: 1, scope: !1471, file: !10, line: 1160, type: !6)
!1475 = !DILocation(line: 1160, column: 17, scope: !1471)
!1476 = !DILocalVariable(name: "session", arg: 2, scope: !1471, file: !10, line: 1160, type: !87)
!1477 = !DILocation(line: 1160, column: 44, scope: !1471)
!1478 = !DILocalVariable(name: "cc", scope: !1471, file: !10, line: 1162, type: !73)
!1479 = !DILocation(line: 1162, column: 10, scope: !1471)
!1480 = !DILocalVariable(name: "pkt", scope: !1471, file: !10, line: 1163, type: !6)
!1481 = !DILocation(line: 1163, column: 12, scope: !1471)
