; ModuleID = '/home/zzhzz/ISSTA23-Artifacts/parser/testcases/gocr.c'
source_filename = "/home/zzhzz/ISSTA23-Artifacts/parser/testcases/gocr.c"
target datalayout = "e-m:e-p:32:32-i64:64-n32:64-S128-ni:1:10:20"
target triple = "wasm32-unknown-wasi"

%struct._IO_FILE = type opaque
%struct.job_s = type { %struct.anon, %struct.anon.0, %struct.anon.1, %struct.anon.2 }
%struct.anon = type { i8*, %struct.pixmap }
%struct.pixmap = type { i8*, i32, i32, i32 }
%struct.anon.0 = type { %struct.pixmap, i32, %struct.list }
%struct.list = type { %struct.element*, %struct.element*, %struct.element**, %struct.element**, i32, i32 }
%struct.element = type { %struct.element*, %struct.element*, i8* }
%struct.anon.1 = type { %struct.list, %struct.list, %struct.tlines, i32, i32, i32, i32, i32 }
%struct.tlines = type { i32, i32, [1024 x i32], [1024 x i32], [1024 x i32], [1024 x i32], [1024 x i32], [1024 x i32] }
%struct.anon.2 = type { i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i8* }

@stderr = external constant %struct._IO_FILE*, align 4
@.str = private unnamed_addr constant [51 x i8] c" realloc failed! level++=%d current[]=%p fix[]=%p\0A\00", align 1
@.str.1 = private unnamed_addr constant [8 x i8] c".pnm.gz\00", align 1
@.str.2 = private unnamed_addr constant [9 x i8] c"gzip -cd\00", align 1
@.str.3 = private unnamed_addr constant [8 x i8] c".pbm.gz\00", align 1
@.str.4 = private unnamed_addr constant [8 x i8] c".pgm.gz\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xlist", scope: !2, file: !6, line: 399, type: !108, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project fd1d8c2f04dde23bee0fb3a7d069a9b1046da979)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !16, globals: !36, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/zzhzz/ISSTA23-Artifacts/parser/testcases/<stdin>", directory: "/home/zzhzz/ISSTA23-Artifacts/parser")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "format", file: !6, line: 34, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "testcases/gocr.c", directory: "/home/zzhzz/ISSTA23-Artifacts/parser")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "ISO8859_1", value: 0)
!10 = !DIEnumerator(name: "TeX", value: 1)
!11 = !DIEnumerator(name: "HTML", value: 2)
!12 = !DIEnumerator(name: "XML", value: 3)
!13 = !DIEnumerator(name: "SGML", value: 4)
!14 = !DIEnumerator(name: "UTF8", value: 5)
!15 = !DIEnumerator(name: "ASCII", value: 6)
!16 = !{!17, !26, !25, !27, !7, !29, !31, !32, !34}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Element", file: !6, line: 42, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "element", file: !6, line: 38, size: 96, elements: !20)
!20 = !{!21, !23, !24}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !19, file: !6, line: 39, baseType: !22, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !19, file: !6, line: 39, baseType: !22, size: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !19, file: !6, line: 40, baseType: !25, size: 32, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32)
!30 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!36 = !{!0, !37}
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "JOB", scope: !2, file: !6, line: 1001, type: !39, isLocal: false, isDefinition: true)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "job_t", file: !6, line: 820, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "job_s", file: !6, line: 775, size: 198048, elements: !42)
!42 = !{!43, !55, !70, !94}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !41, file: !6, line: 780, baseType: !44, size: 160)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !41, file: !6, line: 776, size: 160, elements: !45)
!45 = !{!46, !47}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !44, file: !6, line: 777, baseType: !32, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !44, file: !6, line: 778, baseType: !48, size: 128, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "pix", file: !6, line: 398, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pixmap", file: !6, line: 392, size: 128, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !49, file: !6, line: 393, baseType: !29, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !49, file: !6, line: 394, baseType: !31, size: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !49, file: !6, line: 395, baseType: !31, size: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "bpp", scope: !49, file: !6, line: 396, baseType: !31, size: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !41, file: !6, line: 792, baseType: !56, size: 352, offset: 160)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !41, file: !6, line: 781, size: 352, elements: !57)
!57 = !{!58, !59, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ppo", scope: !56, file: !6, line: 785, baseType: !48, size: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "n_run", scope: !56, file: !6, line: 789, baseType: !31, size: 32, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "dblist", scope: !56, file: !6, line: 791, baseType: !61, size: 192, offset: 160)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "List", file: !6, line: 52, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !6, line: 44, size: 192, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !62, file: !6, line: 45, baseType: !17, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !62, file: !6, line: 46, baseType: !17, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "fix", scope: !62, file: !6, line: 47, baseType: !26, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !62, file: !6, line: 48, baseType: !26, size: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !62, file: !6, line: 49, baseType: !31, size: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !62, file: !6, line: 50, baseType: !31, size: 32, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "res", scope: !41, file: !6, line: 803, baseType: !71, size: 197216, offset: 512)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !41, file: !6, line: 793, size: 197216, elements: !72)
!72 = !{!73, !74, !75, !89, !90, !91, !92, !93}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "boxlist", scope: !71, file: !6, line: 794, baseType: !61, size: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "linelist", scope: !71, file: !6, line: 795, baseType: !61, size: 192, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !71, file: !6, line: 797, baseType: !76, size: 196672, offset: 384)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tlines", file: !6, line: 728, size: 196672, elements: !77)
!77 = !{!78, !79, !80, !84, !85, !86, !87, !88}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !76, file: !6, line: 729, baseType: !31, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !76, file: !6, line: 731, baseType: !31, size: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "m1", scope: !76, file: !6, line: 732, baseType: !81, size: 32768, offset: 64)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 32768, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1024)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "m2", scope: !76, file: !6, line: 733, baseType: !81, size: 32768, offset: 32832)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "m3", scope: !76, file: !6, line: 734, baseType: !81, size: 32768, offset: 65600)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "m4", scope: !76, file: !6, line: 735, baseType: !81, size: 32768, offset: 98368)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "x0", scope: !76, file: !6, line: 736, baseType: !81, size: 32768, offset: 131136)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !76, file: !6, line: 737, baseType: !81, size: 32768, offset: 163904)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "avX", scope: !71, file: !6, line: 801, baseType: !31, size: 32, offset: 197056)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "avY", scope: !71, file: !6, line: 801, baseType: !31, size: 32, offset: 197088)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "sumX", scope: !71, file: !6, line: 802, baseType: !31, size: 32, offset: 197120)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "sumY", scope: !71, file: !6, line: 802, baseType: !31, size: 32, offset: 197152)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "numC", scope: !71, file: !6, line: 802, baseType: !31, size: 32, offset: 197184)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !41, file: !6, line: 819, baseType: !95, size: 320, offset: 197728)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !41, file: !6, line: 804, size: 320, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !105, !106, !107}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !95, file: !6, line: 805, baseType: !31, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "spc", scope: !95, file: !6, line: 808, baseType: !31, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !95, file: !6, line: 809, baseType: !31, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "dust_size", scope: !95, file: !6, line: 811, baseType: !31, size: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "only_numbers", scope: !95, file: !6, line: 812, baseType: !31, size: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !95, file: !6, line: 813, baseType: !31, size: 32, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !95, file: !6, line: 815, baseType: !104, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "FORMAT", file: !6, line: 37, baseType: !5)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !95, file: !6, line: 816, baseType: !32, size: 32, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "db_path", scope: !95, file: !6, line: 817, baseType: !32, size: 32, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "cfilter", scope: !95, file: !6, line: 818, baseType: !32, size: 32, offset: 288)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1120, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 35)
!111 = !{i32 7, !"Dwarf Version", i32 4}
!112 = !{i32 2, !"Debug Info Version", i32 3}
!113 = !{i32 1, !"wchar_size", i32 4}
!114 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project fd1d8c2f04dde23bee0fb3a7d069a9b1046da979)"}
!115 = distinct !DISubprogram(name: "list_init", scope: !6, file: !6, line: 85, type: !116, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !119)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !118}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!119 = !{}
!120 = !DILocalVariable(name: "l", arg: 1, scope: !115, file: !6, line: 85, type: !118)
!121 = !DILocation(line: 85, column: 23, scope: !115)
!122 = !DILocation(line: 86, column: 9, scope: !123)
!123 = distinct !DILexicalBlock(scope: !115, file: !6, line: 86, column: 8)
!124 = !DILocation(line: 86, column: 8, scope: !115)
!125 = !DILocation(line: 87, column: 6, scope: !123)
!126 = !DILocation(line: 89, column: 15, scope: !115)
!127 = !DILocation(line: 89, column: 18, scope: !115)
!128 = !DILocation(line: 89, column: 23, scope: !115)
!129 = !DILocation(line: 89, column: 3, scope: !115)
!130 = !DILocation(line: 89, column: 6, scope: !115)
!131 = !DILocation(line: 89, column: 13, scope: !115)
!132 = !DILocation(line: 90, column: 3, scope: !115)
!133 = !DILocation(line: 90, column: 6, scope: !115)
!134 = !DILocation(line: 90, column: 14, scope: !115)
!135 = !DILocation(line: 91, column: 3, scope: !115)
!136 = !DILocation(line: 91, column: 6, scope: !115)
!137 = !DILocation(line: 91, column: 10, scope: !115)
!138 = !DILocation(line: 92, column: 3, scope: !115)
!139 = !DILocation(line: 92, column: 6, scope: !115)
!140 = !DILocation(line: 92, column: 12, scope: !115)
!141 = !DILocation(line: 93, column: 3, scope: !115)
!142 = !DILocation(line: 93, column: 6, scope: !115)
!143 = !DILocation(line: 93, column: 8, scope: !115)
!144 = !DILocation(line: 94, column: 1, scope: !115)
!145 = distinct !DISubprogram(name: "list_element_from_data", scope: !6, file: !6, line: 97, type: !146, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !119)
!146 = !DISubroutineType(types: !147)
!147 = !{!17, !118, !25}
!148 = !DILocalVariable(name: "l", arg: 1, scope: !145, file: !6, line: 97, type: !118)
!149 = !DILocation(line: 97, column: 40, scope: !145)
!150 = !DILocalVariable(name: "data", arg: 2, scope: !145, file: !6, line: 97, type: !25)
!151 = !DILocation(line: 97, column: 49, scope: !145)
!152 = !DILocalVariable(name: "temp", scope: !145, file: !6, line: 98, type: !17)
!153 = !DILocation(line: 98, column: 12, scope: !145)
!154 = !DILocation(line: 100, column: 9, scope: !155)
!155 = distinct !DILexicalBlock(scope: !145, file: !6, line: 100, column: 8)
!156 = !DILocation(line: 100, column: 11, scope: !155)
!157 = !DILocation(line: 100, column: 15, scope: !155)
!158 = !DILocation(line: 100, column: 8, scope: !145)
!159 = !DILocation(line: 101, column: 5, scope: !155)
!160 = !DILocation(line: 103, column: 17, scope: !161)
!161 = distinct !DILexicalBlock(scope: !145, file: !6, line: 103, column: 8)
!162 = !DILocation(line: 103, column: 20, scope: !161)
!163 = !DILocation(line: 103, column: 15, scope: !161)
!164 = !DILocation(line: 103, column: 8, scope: !145)
!165 = !DILocation(line: 104, column: 5, scope: !161)
!166 = !DILocation(line: 106, column: 3, scope: !145)
!167 = !DILocation(line: 106, column: 11, scope: !145)
!168 = !DILocation(line: 106, column: 17, scope: !145)
!169 = !DILocation(line: 106, column: 25, scope: !145)
!170 = !DILocation(line: 106, column: 22, scope: !145)
!171 = !DILocation(line: 107, column: 12, scope: !172)
!172 = distinct !DILexicalBlock(scope: !145, file: !6, line: 106, column: 32)
