; ModuleID = '/home/zzhzz/ISSTA23-Artifacts/parser/testcases/test.c'
source_filename = "/home/zzhzz/ISSTA23-Artifacts/parser/testcases/test.c"
target datalayout = "e-m:e-p:32:32-i64:64-n32:64-S128-ni:1:10:20"
target triple = "wasm32-unknown-wasi"

%struct.cc_pqueue_conf_s = type { i32, float, i32 (i8*, i8*)*, i8* (i32)*, i8* (i32, i32)*, void (i8*)* }
%struct.cc_pqueue_s = type { i32, i32, float, i8**, i8* (i32)*, i8* (i32, i32)*, void (i8*)*, i32 (i8*, i8*)* }

@.str = private unnamed_addr constant [20 x i8] c"malloc size is :%lu\00", align 1
@.str.1 = private unnamed_addr constant [34 x i8] c"cc_pqueue_new_conf: capacity: %d\0A\00", align 1
@.str.2 = private unnamed_addr constant [33 x i8] c"pq size is: %d, capacity is: %d\0A\00", align 1
@.str.3 = private unnamed_addr constant [65 x i8] c"[%lu]before parent, buffer is %d, index is %lu, after index: %d\0A\00", align 1
@.str.4 = private unnamed_addr constant [11 x i8] c"DEBUG: %d\0A\00", align 1
@.str.5 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.6 = private unnamed_addr constant [9 x i8] c"e is %d\0A\00", align 1
@.str.7 = private unnamed_addr constant [9 x i8] c"f is %d\0A\00", align 1
@.str.8 = private unnamed_addr constant [30 x i8] c"before pushed 1, capacity: %d\00", align 1
@.str.9 = private unnamed_addr constant [15 x i8] c"after pushed 1\00", align 1
@.str.10 = private unnamed_addr constant [13 x i8] c"after push 2\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project fd1d8c2f04dde23bee0fb3a7d069a9b1046da979)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !16, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/zzhzz/ISSTA23-Artifacts/parser/testcases/<stdin>", directory: "/home/zzhzz/ISSTA23-Artifacts/parser")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cc_stat", file: !4, line: 12, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "testcases/test.c", directory: "/home/zzhzz/ISSTA23-Artifacts/parser")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15}
!7 = !DIEnumerator(name: "CC_OK", value: 0)
!8 = !DIEnumerator(name: "CC_ERR_ALLOC", value: 1)
!9 = !DIEnumerator(name: "CC_ERR_INVALID_CAPACITY", value: 2)
!10 = !DIEnumerator(name: "CC_ERR_INVALID_RANGE", value: 3)
!11 = !DIEnumerator(name: "CC_ERR_MAX_CAPACITY", value: 4)
!12 = !DIEnumerator(name: "CC_ERR_KEY_NOT_FOUND", value: 6)
!13 = !DIEnumerator(name: "CC_ERR_VALUE_NOT_FOUND", value: 7)
!14 = !DIEnumerator(name: "CC_ERR_OUT_OF_RANGE", value: 8)
!15 = !DIEnumerator(name: "CC_ITER_END", value: 9)
!16 = !{!17, !20, !21, !22}
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !18, line: 72, baseType: !19)
!18 = !DIFile(filename: "/data/wasi-sdk/build/wasi-sdk-14.0/share/wasi-sysroot/include/bits/alltypes.h", directory: "")
!19 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 32)
!23 = !{i32 7, !"Dwarf Version", i32 4}
!24 = !{i32 2, !"Debug Info Version", i32 3}
!25 = !{i32 1, !"wchar_size", i32 4}
!26 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project fd1d8c2f04dde23bee0fb3a7d069a9b1046da979)"}
!27 = distinct !DISubprogram(name: "CC_PARENT", scope: !4, file: !4, line: 44, type: !28, scopeLine: 44, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !30)
!28 = !DISubroutineType(types: !29)
!29 = !{!20, !20}
!30 = !{}
!31 = !DILocalVariable(name: "x", arg: 1, scope: !27, file: !4, line: 44, type: !20)
!32 = !DILocation(line: 44, column: 15, scope: !27)
!33 = !DILocation(line: 44, column: 27, scope: !27)
!34 = !DILocation(line: 44, column: 29, scope: !27)
!35 = !DILocation(line: 44, column: 34, scope: !27)
!36 = !DILocation(line: 44, column: 19, scope: !27)
!37 = distinct !DISubprogram(name: "CC_LEFT", scope: !4, file: !4, line: 45, type: !28, scopeLine: 45, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !30)
!38 = !DILocalVariable(name: "x", arg: 1, scope: !37, file: !4, line: 45, type: !20)
!39 = !DILocation(line: 45, column: 13, scope: !37)
!40 = !DILocation(line: 45, column: 31, scope: !37)
!41 = !DILocation(line: 45, column: 29, scope: !37)
!42 = !DILocation(line: 45, column: 33, scope: !37)
!43 = !DILocation(line: 45, column: 20, scope: !37)
!44 = distinct !DISubprogram(name: "CC_RIGHT", scope: !4, file: !4, line: 46, type: !28, scopeLine: 46, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !30)
!45 = !DILocalVariable(name: "x", arg: 1, scope: !44, file: !4, line: 46, type: !20)
!46 = !DILocation(line: 46, column: 14, scope: !44)
!47 = !DILocation(line: 46, column: 31, scope: !44)
!48 = !DILocation(line: 46, column: 29, scope: !44)
!49 = !DILocation(line: 46, column: 33, scope: !44)
!50 = !DILocation(line: 46, column: 20, scope: !44)
!51 = distinct !DISubprogram(name: "cc_pqueue_conf_init", scope: !4, file: !4, line: 111, type: !52, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !30)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !54, !62}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "CC_PQueueConf", file: !4, line: 91, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cc_pqueue_conf_s", file: !4, line: 70, size: 192, elements: !57)
!57 = !{!58, !59, !61, !67, !71, !75}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !56, file: !4, line: 73, baseType: !17, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "exp_factor", scope: !56, file: !4, line: 77, baseType: !60, size: 32, offset: 32)
!60 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !56, file: !4, line: 83, baseType: !62, size: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 32)
!63 = !DISubroutineType(types: !64)
!64 = !{!20, !65, !65}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "mem_alloc", scope: !56, file: !4, line: 88, baseType: !68, size: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32)
!69 = !DISubroutineType(types: !70)
!70 = !{!21, !17}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !56, file: !4, line: 89, baseType: !72, size: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!73 = !DISubroutineType(types: !74)
!74 = !{!21, !17, !17}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mem_free", scope: !56, file: !4, line: 90, baseType: !76, size: 32, offset: 160)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !21}
!79 = !DILocalVariable(name: "conf", arg: 1, scope: !51, file: !4, line: 111, type: !54)
!80 = !DILocation(line: 111, column: 41, scope: !51)
!81 = !DILocalVariable(name: "cmp", arg: 2, scope: !51, file: !4, line: 111, type: !62)
!82 = !DILocation(line: 111, column: 53, scope: !51)
!83 = !DILocation(line: 113, column: 5, scope: !51)
!84 = !DILocation(line: 113, column: 11, scope: !51)
!85 = !DILocation(line: 113, column: 22, scope: !51)
!86 = !DILocation(line: 114, column: 5, scope: !51)
!87 = !DILocation(line: 114, column: 11, scope: !51)
!88 = !DILocation(line: 114, column: 22, scope: !51)
!89 = !DILocation(line: 115, column: 5, scope: !51)
!90 = !DILocation(line: 115, column: 11, scope: !51)
!91 = !DILocation(line: 115, column: 22, scope: !51)
!92 = !DILocation(line: 116, column: 24, scope: !51)
!93 = !DILocation(line: 116, column: 5, scope: !51)
!94 = !DILocation(line: 116, column: 11, scope: !51)
!95 = !DILocation(line: 116, column: 22, scope: !51)
!96 = !DILocation(line: 117, column: 5, scope: !51)
!97 = !DILocation(line: 117, column: 11, scope: !51)
!98 = !DILocation(line: 117, column: 22, scope: !51)
!99 = !DILocation(line: 118, column: 5, scope: !51)
!100 = !DILocation(line: 118, column: 11, scope: !51)
!101 = !DILocation(line: 118, column: 22, scope: !51)
!102 = !DILocation(line: 119, column: 1, scope: !51)
!103 = distinct !DISubprogram(name: "cc_pqueue_new", scope: !4, file: !4, line: 130, type: !104, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !30)
!104 = !DISubroutineType(types: !105)
!105 = !{!3, !106, !62}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "CC_PQueue", file: !4, line: 63, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cc_pqueue_s", file: !4, line: 49, size: 256, elements: !110)
!110 = !{!111, !112, !113, !114, !116, !117, !118, !119}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !109, file: !4, line: 50, baseType: !17, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !109, file: !4, line: 51, baseType: !17, size: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "exp_factor", scope: !109, file: !4, line: 52, baseType: !60, size: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !109, file: !4, line: 53, baseType: !115, size: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mem_alloc", scope: !109, file: !4, line: 56, baseType: !68, size: 32, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !109, file: !4, line: 57, baseType: !72, size: 32, offset: 160)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "mem_free", scope: !109, file: !4, line: 58, baseType: !76, size: 32, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !109, file: !4, line: 61, baseType: !62, size: 32, offset: 224)
!120 = !DILocalVariable(name: "out", arg: 1, scope: !103, file: !4, line: 130, type: !106)
!121 = !DILocation(line: 130, column: 40, scope: !103)
!122 = !DILocalVariable(name: "cmp", arg: 2, scope: !103, file: !4, line: 130, type: !62)
!123 = !DILocation(line: 130, column: 51, scope: !103)
!124 = !DILocalVariable(name: "conf", scope: !103, file: !4, line: 132, type: !55)
!125 = !DILocation(line: 132, column: 19, scope: !103)
!126 = !DILocation(line: 133, column: 32, scope: !103)
!127 = !DILocation(line: 133, column: 5, scope: !103)
!128 = !DILocation(line: 134, column: 38, scope: !103)
!129 = !DILocation(line: 134, column: 12, scope: !103)
!130 = !DILocation(line: 134, column: 5, scope: !103)
!131 = distinct !DISubprogram(name: "cc_pqueue_new_conf", scope: !4, file: !4, line: 154, type: !132, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !30)
!132 = !DISubroutineType(types: !133)
!133 = !{!3, !134, !106}
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!137 = !DILocalVariable(name: "conf", arg: 1, scope: !131, file: !4, line: 154, type: !134)
!138 = !DILocation(line: 154, column: 61, scope: !131)
!139 = !DILocalVariable(name: "out", arg: 2, scope: !131, file: !4, line: 154, type: !106)
!140 = !DILocation(line: 154, column: 79, scope: !131)
!141 = !DILocalVariable(name: "ex", scope: !131, file: !4, line: 156, type: !60)
!142 = !DILocation(line: 156, column: 11, scope: !131)
!143 = !DILocation(line: 160, column: 9, scope: !144)
!144 = distinct !DILexicalBlock(scope: !131, file: !4, line: 160, column: 9)
!145 = !DILocation(line: 160, column: 15, scope: !144)
!146 = !DILocation(line: 160, column: 26, scope: !144)
!147 = !DILocation(line: 160, column: 9, scope: !131)
!148 = !DILocation(line: 161, column: 12, scope: !144)
!149 = !DILocation(line: 161, column: 9, scope: !144)
!150 = !DILocation(line: 163, column: 14, scope: !144)
!151 = !DILocation(line: 163, column: 20, scope: !144)
!152 = !DILocation(line: 163, column: 12, scope: !144)
!153 = !DILocation(line: 167, column: 10, scope: !154)
!154 = distinct !DILexicalBlock(scope: !131, file: !4, line: 167, column: 9)
!155 = !DILocation(line: 167, column: 16, scope: !154)
!156 = !DILocation(line: 167, column: 25, scope: !154)
!157 = !DILocation(line: 167, column: 28, scope: !154)
!158 = !DILocation(line: 167, column: 52, scope: !154)
!159 = !DILocation(line: 167, column: 58, scope: !154)
!160 = !DILocation(line: 167, column: 50, scope: !154)
!161 = !DILocation(line: 167, column: 34, scope: !154)
!162 = !DILocation(line: 167, column: 31, scope: !154)
!163 = !DILocation(line: 167, column: 9, scope: !131)
!164 = !DILocation(line: 168, column: 9, scope: !154)
!165 = !DILocalVariable(name: "pq", scope: !131, file: !4, line: 170, type: !107)
!166 = !DILocation(line: 170, column: 16, scope: !131)
!167 = !DILocation(line: 170, column: 21, scope: !131)
!168 = !DILocation(line: 170, column: 27, scope: !131)
!169 = !DILocation(line: 172, column: 10, scope: !170)
!170 = distinct !DILexicalBlock(scope: !131, file: !4, line: 172, column: 9)
!171 = !DILocation(line: 172, column: 9, scope: !131)
!172 = !DILocation(line: 173, column: 9, scope: !170)
!173 = !DILocation(line: 175, column: 35, scope: !131)
!174 = !DILocation(line: 175, column: 41, scope: !131)
!175 = !DILocation(line: 175, column: 50, scope: !131)
!176 = !DILocation(line: 175, column: 5, scope: !131)
!177 = !DILocalVariable(name: "buff", scope: !131, file: !4, line: 176, type: !115)
!178 = !DILocation(line: 176, column: 12, scope: !131)
!179 = !DILocation(line: 176, column: 19, scope: !131)
!180 = !DILocation(line: 176, column: 25, scope: !131)
!181 = !DILocation(line: 176, column: 35, scope: !131)
